introduction-to-pytorch.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: ^:{}
#+TITLE: pytorch-basic
* Quickstart
** Working with data
   + pytorch有两个primitive来处理data:
     - torch.utils.data.Dataset: Dataset存储sample和对应的label
     - torch.utils.data.DataLoader: DataLoader在Dataset的基础上wrap了一层iterable
   + 代码如下
     #+begin_src python
       import torch
       from torch import nn
       from torch.utils.data import DataLoader
       from torchvision import datasets
       from torchvision.transforms import ToTensor, Lambda, Compose
       import matplotlib.pyplot as plt
     #+end_src
   + 我们本tutorial会使用TorchVision dataset
   + torchvision.datasets module包括了很多Dataset objects,很多是现实世界的数据集.本tutorial使用FashionMNIST
     dataset
   + 每个TorchVision Dataset都有两个argument:
     - transform: 修改sample
     - target_transform: 修改label
   + 下载FashionMNIST的:
     - 代码如下
       #+begin_src python
         import torch
         from torch import nn
         from torch.utils.data import DataLoader
         from torchvision import datasets
         from torchvision.transforms import ToTensor, Lambda, Compose
         import matplotlib.pyplot as plt


         # Download training data from open datasets.
         training_data = datasets.FashionMNIST(
             root="data",
             train=True,
             download=True,
             transform=ToTensor(),
         )

         # Download test data from open datasets.
         test_data = datasets.FashionMNIST(
             root="data",
             train=False,
             download=True,
             transform=ToTensor(),
         )
       #+end_src
     - 输出如下:
       #+begin_example
         /Users/fenghaoran/.virtualenvs/3ENV/bin/python3.7 /Users/fenghaoran/github/pytorch/code/001.py
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz to data/FashionMNIST/raw/train-images-idx3-ubyte.gz
         100.0%
         Extracting data/FashionMNIST/raw/train-images-idx3-ubyte.gz to data/FashionMNIST/raw

         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw/train-labels-idx1-ubyte.gz
         100.6%
         Extracting data/FashionMNIST/raw/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw

         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz
         100.0%
         Extracting data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw

         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz
         119.3%
         Extracting data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw
       #+end_example
   + 我们把Dataset作为参数传入给DataLoader.这个会把我们的dataset转换成一个iterable,这个iterable支持:
     - automatic batching
     - sampling
     - shuffling
     - multiprocess
   + 下面的例子就是我们定义了batch_size为64, 然后每次循环, dataloader会返回一个包含64个feature和label
     - 代码如下
       #+begin_src python
         batch_size = 64

         # Create data loaders
         train_dataloader = DataLoader(training_data, batch_size=batch_size)
         test_dataloader = DataLoader(test_data, batch_size=batch_size)

         for X, y in test_dataloader:
             print("Shape of X [N, C, H, W]: ", X.shape)
             print("Shape of y: ", y.dtype)
             break
       #+end_src
     - 输出如下
       #+begin_example
         Shape of X [N, C, H, W]:  torch.Size([64, 1, 28, 28])
         Shape of y:  torch.int64
       #+end_example
