introduction-to-pytorch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-18 Thu 19:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pytorch-basic</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="harrifeng@outlook.com" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">pytorch-basic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org43cf6ee">1. Quickstart</a>
<ul>
<li><a href="#org6b59beb">1.1. Working with data</a></li>
<li><a href="#org4765dd6">1.2. Creating Models</a></li>
</ul>
</li>
<li><a href="#org54f5ee9">2. Tensors</a>
<ul>
<li><a href="#orgeff0b06">2.1. Initializing a Tensor</a>
<ul>
<li><a href="#orgc09b41e">2.1.1. Directly from data</a></li>
<li><a href="#org4f9161a">2.1.2. From a NumPy array</a></li>
<li><a href="#org177bf35">2.1.3. From another tensor</a></li>
<li><a href="#org1c7cbf1">2.1.4. With random or constant values:</a></li>
</ul>
</li>
<li><a href="#org4555655">2.2. Attributes of Tensor</a></li>
<li><a href="#orgce4ab38">2.3. Operations on Tensors</a>
<ul>
<li><a href="#org1ac9655">2.3.1. Standard numpy-like indexing and slicing</a></li>
<li><a href="#org48f7758">2.3.2. Joining tensors</a></li>
<li><a href="#orgb679c13">2.3.3. Arithmetic operations</a></li>
</ul>
</li>
<li><a href="#orgd712754">2.4. Bridge with Numpy</a>
<ul>
<li><a href="#org7c471ab">2.4.1. Tensor to Numpy array</a></li>
<li><a href="#org1075845">2.4.2. Numpy array to Tensor</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbe3c536">3. Datasets &amp; Dataloaders</a>
<ul>
<li><a href="#orgf200b11">3.1. Loading a Dataset</a></li>
<li><a href="#org87dfa63">3.2. Iterating and Visualizing the Dataset</a></li>
<li><a href="#org3f074e9">3.3. Creating a Custom Dataset for your files</a>
<ul>
<li><a href="#org4aa0077">3.3.1. __init__</a></li>
<li><a href="#orgb23d5f2">3.3.2. __len__</a></li>
<li><a href="#orgf6d3144">3.3.3. __getitem__</a></li>
</ul>
</li>
<li><a href="#orgab32d67">3.4. Preparing your data for training with DataLoaders</a></li>
<li><a href="#orgdd5216d">3.5. Iterate through the DataLoader</a></li>
</ul>
</li>
<li><a href="#org6ce1712">4. Transforms</a>
<ul>
<li><a href="#org07bcbf3">4.1. ToTensor()</a></li>
<li><a href="#org68e0198">4.2. Lambda Transforms</a></li>
</ul>
</li>
<li><a href="#orgb55af80">5. Build The Neural Network</a>
<ul>
<li><a href="#org9f34a34">5.1. Get Device for Training</a></li>
<li><a href="#orgc267249">5.2. Define the Class</a></li>
<li><a href="#org22fc26e">5.3. Model Layers</a>
<ul>
<li><a href="#org8ff46b1">5.3.1. nn.Flatten</a></li>
<li><a href="#orged00327">5.3.2. nn.Linear</a></li>
<li><a href="#orgb0d9a9a">5.3.3. nn.ReLU</a></li>
<li><a href="#org833239e">5.3.4. nn.Sequential</a></li>
<li><a href="#org60d42c3">5.3.5. nn.Softmax</a></li>
</ul>
</li>
<li><a href="#orgd69bb23">5.4. Model Parameters</a></li>
</ul>
</li>
<li><a href="#orgb8eff61">6. Automatic Differentitaion With torch.autograd</a>
<ul>
<li><a href="#org191d53d">6.1. Computing Gradients</a></li>
<li><a href="#org8116a39">6.2. Disabling Gradient Tracking</a></li>
<li><a href="#org061bfc4">6.3. More on Computational Graphs</a></li>
</ul>
</li>
<li><a href="#org6b7d65a">7. Optimizing Model Parameters</a>
<ul>
<li><a href="#org489aa06">7.1. Prereuisite Code</a></li>
<li><a href="#orgd546989">7.2. Hyperparameters</a></li>
<li><a href="#org6a4debe">7.3. Optimization Loop</a>
<ul>
<li><a href="#orgb5bb0c0">7.3.1. Loss Function</a></li>
<li><a href="#org54eabb3">7.3.2. Optimizer</a></li>
</ul>
</li>
<li><a href="#org662063c">7.4. Full Implementation</a></li>
</ul>
</li>
<li><a href="#org32f9cbf">8. Save and Load the Model</a>
<ul>
<li><a href="#org595b05a">8.1. Saving and Loading Model Weights</a></li>
<li><a href="#org89d5d93">8.2. Saving and Loading Models with Shapes</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org43cf6ee" class="outline-2">
<h2 id="org43cf6ee"><span class="section-number-2">1</span> Quickstart</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6b59beb" class="outline-3">
<h3 id="org6b59beb"><span class="section-number-3">1.1</span> Working with data</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>pytorch有两个primitive来处理data:
<ul class="org-ul">
<li>torch.utils.data.Dataset: Dataset存储sample和对应的label</li>
<li>torch.utils.data.DataLoader: DataLoader在Dataset的基础上wrap了一层iterable</li>
</ul></li>
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">from</span> torch <span style="color: #9d0006;">import</span> nn
<span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> DataLoader
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets
<span style="color: #9d0006;">from</span> torchvision.transforms <span style="color: #9d0006;">import</span> ToTensor, Lambda, Compose
<span style="color: #9d0006;">import</span> matplotlib.pyplot <span style="color: #9d0006;">as</span> plt
</pre>
</div></li>
<li>我们本tutorial会使用TorchVision dataset</li>
<li>torchvision.datasets module包括了很多Dataset objects,很多是现实世界的数据集.本tutorial使用FashionMNIST
dataset</li>
<li>每个TorchVision Dataset都有两个argument:
<ul class="org-ul">
<li>transform: 修改sample</li>
<li>target_transform: 修改label</li>
</ul></li>
<li>下载FashionMNIST的:
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">from</span> torch <span style="color: #9d0006;">import</span> nn
<span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> DataLoader
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets
<span style="color: #9d0006;">from</span> torchvision.transforms <span style="color: #9d0006;">import</span> ToTensor, Lambda, Compose
<span style="color: #9d0006;">import</span> matplotlib.pyplot <span style="color: #9d0006;">as</span> plt


<span style="color: #a89984;"># </span><span style="color: #a89984;">Download training data from open datasets.</span>
<span style="color: #076678;">training_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>,
<span style="background-color: #ebdbb2;"> </span>   train=<span style="color: #8f3f71;">True</span>,
<span style="background-color: #ebdbb2;"> </span>   download=<span style="color: #8f3f71;">True</span>,
<span style="background-color: #ebdbb2;"> </span>   transform=ToTensor(),
)

<span style="color: #a89984;"># </span><span style="color: #a89984;">Download test data from open datasets.</span>
<span style="color: #076678;">test_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>,
<span style="background-color: #ebdbb2;"> </span>   train=<span style="color: #8f3f71;">False</span>,
<span style="background-color: #ebdbb2;"> </span>   download=<span style="color: #8f3f71;">True</span>,
<span style="background-color: #ebdbb2;"> </span>   transform=ToTensor(),
)
</pre>
</div></li>
<li><p>
输出如下:
</p>
<pre class="example" id="org89a5426">
/Users/fenghaoran/.virtualenvs/3ENV/bin/python3.7 /Users/fenghaoran/github/pytorch/code/001.py
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz to data/FashionMNIST/raw/train-images-idx3-ubyte.gz
100.0%
Extracting data/FashionMNIST/raw/train-images-idx3-ubyte.gz to data/FashionMNIST/raw

Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw/train-labels-idx1-ubyte.gz
100.6%
Extracting data/FashionMNIST/raw/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw

Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz
100.0%
Extracting data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw

Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz
119.3%
Extracting data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw
</pre></li>
</ul></li>
<li>我们把Dataset作为参数传入给DataLoader.这个会把我们的dataset转换成一个iterable,这个iterable支持:
<ul class="org-ul">
<li>automatic batching</li>
<li>sampling</li>
<li>shuffling</li>
<li>multiprocess</li>
</ul></li>
<li>下面的例子就是我们定义了batch_size为64, 然后每次循环, dataloader会返回一个包含64个feature和label
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">batch_size</span> = 64

<span style="color: #a89984;"># </span><span style="color: #a89984;">Create data loaders</span>
<span style="color: #076678;">train_dataloader</span> = DataLoader(training_data, batch_size=batch_size)
<span style="color: #076678;">test_dataloader</span> = DataLoader(test_data, batch_size=batch_size)

<span style="color: #9d0006;">for</span> X, y <span style="color: #9d0006;">in</span> test_dataloader:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Shape of X [N, C, H, W]: "</span>, X.shape)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Shape of y: "</span>, y.dtype)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">break</span>
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgd03ea84">
Shape of X [N, C, H, W]:  torch.Size([64, 1, 28, 28])
Shape of y:  torch.int64
</pre></li>
</ul></li>
</ul>
</div>
</div>
