introduction-to-pytorch.org
** Creating Models
   + 为了创建一个neural network,我们要创建一个继承自nn.Module的class:
     - 我们需要在__init__ function里面定义我们的network的layer
     - 我们还需要在forward函数里面data如何在network上面传输
     - 如果存在GPU,我们还可以把神经网络的代码移动到GPU
     - 代码如下
       #+begin_src python
         # Define model
         class NeuralNetwork(nn.Module):
             def __init__(self):
                 super(NeuralNetwork, self).__init__()
                 self.flatten = nn.Flatten()
                 self.linear_relu_stack = nn.Sequential(
                     nn.Linear(28 * 28, 512),
                     nn.ReLU(),
                     nn.Linear(512, 512),
                     nn.ReLU(),
                     nn.Linear(512, 10),
                     nn.ReLU(),
                 )

             def forward(self, x):
                 x = self.flatten(x)
                 logits = self.linear_relu_stack(x)
                 return logits


         model = NeuralNetwork().to(device)
         print(model)
       #+end_src
     - 输出如下
       #+begin_example
         Using cpu device
         NeuralNetwork(
           (flatten): Flatten(start_dim=1, end_dim=-1)
           (linear_relu_stack): Sequential(
             (0): Linear(in_features=784, out_features=512, bias=True)
             (1): ReLU()
             (2): Linear(in_features=512, out_features=512, bias=True)
             (3): ReLU()
             (4): Linear(in_features=512, out_features=10, bias=True)
             (5): ReLU()
           )
         )
       #+end_example
   + TODO
* Tensors
  + tensors是一种特殊的数据结构,和array或者matrix非常相似.
  + 在pytorch里面,我们使用tensor来encode:
    - model的参数
    - model的input
    - model的output
  + Tensor拥有NumPy的ndarray几乎所有的功能,额外还能支持GPU加速
  + 在实际应用中, tensor和NumPy array经常share underlying memory(这样可以减少数据库拷贝)
  + Tensor还设计了能够自动计算梯度
  + 本节需要的头文件
    #+begin_src python
      import torch
      import numpy as np
    #+end_src
** Initializing a Tensor
   + Tensor可以使用以多种方法初始化
*** Directly from data
    + 可以从data直接初始化tensor
      #+begin_src python
        data = [[1, 2], [3, 4]]
        x_data = torch.tensor(data)
      #+end_src
*** From a NumPy array
    + 也可以从NumPy array初始化tensor,也可以从tensor转换成NumPy array
      #+begin_src python
        np_array = np.array(data)
        x_np = torch.from_numpy(np_array)
      #+end_src
*** From another tensor
    + 新的tensor会保留一些特性(shape, datatype), 当然我们也可以明确的override这些特性.不过值就不继承了,
      比如ones_like就会把原来的matrix的所有值换成1
      - 代码如下:
        #+begin_src python
          x_ones = torch.ones_like(x_data)  # retains the properties of x_data
          print(f"Ones Tensor: \n {x_ones} \n")

          x_rand = torch.rand_like(
              x_data, dtype=torch.float
          )  # override the datatype of x_data
          print(f"Random Tensor: \n {x_rand} \n")
        #+end_src
      - 输出如下:
        #+begin_example
          Ones Tensor:
           tensor([[1, 1],
                  [1, 1]])

          Random Tensor:
           tensor([[0.7919, 0.3389],
                  [0.3505, 0.1489]])
        #+end_example
*** With random or constant values:
    + 我们可以使用一个tuple来定义tensor的dimensions,然后作为一个参数传递给初始化函数:
      - 代码如下:
        #+begin_src python
          shape = (
              2,
              3,
          )
          rand_tensor = torch.rand(shape)
          ones_tensor = torch.ones(shape)
          zeros_tensor = torch.zeros(shape)

          print(f"Random Tensor: \n {rand_tensor} \n")
          print(f"Ones Tensor: \n {ones_tensor} \n")
          print(f"Zeros Tensor: \n {zeros_tensor} \n")
        #+end_src
      - 输出如下:
        #+begin_example
          Random Tensor:
           tensor([[0.6669, 0.3043, 0.1660],
                  [0.6319, 0.2304, 0.6747]])

          Ones Tensor:
           tensor([[1., 1., 1.],
                  [1., 1., 1.]])

          Zeros Tensor:
           tensor([[0., 0., 0.],
                  [0., 0., 0.]])
        #+end_example
** Attributes of Tensor
   + tensor的attribute描述了他们的shape,datatype,和他们所存储的device
     - 代码如下
       #+begin_src python
         tensor = torch.rand(3, 4)

         print(f"Shape of tensor: {tensor.shape}")
         print(f"Datatype of tensor: {tensor.dtype}")
         print(f"Device tensor is stored on: {tensor.device}")
       #+end_src
     - 输出如下
       #+begin_example
         Shape of tensor: torch.Size([3, 4])
         Datatype of tensor: torch.float32
         Device tensor is stored on: cpu
       #+end_example
** Operations on Tensors
   + tensor支持100多种操作,包括:
     - arithmetic
     - linear algebra
     - matrix manipulation(transposing, indexing, slicing)
     - sampling
   + 这些操作可以在GPU上面或者CPU上面运行.默认情况下是在cpu运行.如果想在GPU运行,需要明确的使用`to`
     函数.需要注意的是跨设备(从CPU到GPU)拷贝tensor是非常expensive的操作,费时间,费内存
     #+begin_src python
       if torch.cuda.is_available():
           tensor = tensor.to("cuda")
     #+end_src
   + 下面我们列举一些处理数据的api,和NumPy比起来是非常类似的
