introduction-to-pytorch.html
<div id="outline-container-org4765dd6" class="outline-3">
<h3 id="org4765dd6"><span class="section-number-3">1.2</span> Creating Models</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>为了创建一个neural network,我们要创建一个继承自nn.Module的class:
<ul class="org-ul">
<li>我们需要在__init__ function里面定义我们的network的layer</li>
<li>我们还需要在forward函数里面data如何在network上面传输</li>
<li>如果存在GPU,我们还可以把神经网络的代码移动到GPU</li>
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a89984;"># </span><span style="color: #a89984;">Define model</span>
<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">NeuralNetwork</span>(nn.Module):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #af3a03;">super</span>(NeuralNetwork, <span style="color: #9d0006;">self</span>).__init__()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.flatten = nn.Flatten()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.linear_relu_stack = nn.Sequential(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(28 * 28, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 10),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   )

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">forward</span>(<span style="color: #9d0006;">self</span>, x):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">x</span> = <span style="color: #9d0006;">self</span>.flatten(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">logits</span> = <span style="color: #9d0006;">self</span>.linear_relu_stack(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> logits


<span style="color: #076678;">model</span> = NeuralNetwork().to(device)
<span style="color: #9d0006;">print</span>(model)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org001157d">
Using cpu device
NeuralNetwork(
  (flatten): Flatten(start_dim=1, end_dim=-1)
  (linear_relu_stack): Sequential(
    (0): Linear(in_features=784, out_features=512, bias=True)
    (1): ReLU()
    (2): Linear(in_features=512, out_features=512, bias=True)
    (3): ReLU()
    (4): Linear(in_features=512, out_features=10, bias=True)
    (5): ReLU()
  )
)
</pre></li>
</ul></li>
<li>TODO</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org54f5ee9" class="outline-2">
<h2 id="org54f5ee9"><span class="section-number-2">2</span> Tensors</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>tensors是一种特殊的数据结构,和array或者matrix非常相似.</li>
<li>在pytorch里面,我们使用tensor来encode:
<ul class="org-ul">
<li>model的参数</li>
<li>model的input</li>
<li>model的output</li>
</ul></li>
<li>Tensor拥有NumPy的ndarray几乎所有的功能,额外还能支持GPU加速</li>
<li>在实际应用中, tensor和NumPy array经常share underlying memory(这样可以减少数据库拷贝)</li>
<li>Tensor还设计了能够自动计算梯度</li>
<li><p>
本节需要的头文件
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">import</span> numpy <span style="color: #9d0006;">as</span> np
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-orgeff0b06" class="outline-3">
<h3 id="orgeff0b06"><span class="section-number-3">2.1</span> Initializing a Tensor</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Tensor可以使用以多种方法初始化</li>
</ul>
</div>
<div id="outline-container-orgc09b41e" class="outline-4">
<h4 id="orgc09b41e"><span class="section-number-4">2.1.1</span> Directly from data</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li><p>
可以从data直接初始化tensor
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">data</span> = [[1, 2], [3, 4]]
<span style="color: #076678;">x_data</span> = torch.tensor(data)
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org4f9161a" class="outline-4">
<h4 id="org4f9161a"><span class="section-number-4">2.1.2</span> From a NumPy array</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li><p>
也可以从NumPy array初始化tensor,也可以从tensor转换成NumPy array
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">np_array</span> = np.array(data)
<span style="color: #076678;">x_np</span> = torch.from_numpy(np_array)
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org177bf35" class="outline-4">
<h4 id="org177bf35"><span class="section-number-4">2.1.3</span> From another tensor</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>新的tensor会保留一些特性(shape, datatype), 当然我们也可以明确的override这些特性.不过值就不继承了,
比如ones_like就会把原来的matrix的所有值换成1
<ul class="org-ul">
<li><p>
代码如下:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">x_ones</span> = torch.ones_like(x_data)  <span style="color: #a89984;"># </span><span style="color: #a89984;">retains the properties of x_data</span>
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Ones Tensor: \n {x_ones} \n"</span>)

<span style="color: #076678;">x_rand</span> = torch.rand_like(
<span style="background-color: #ebdbb2;"> </span>   x_data, dtype=torch.<span style="color: #af3a03;">float</span>
)  <span style="color: #a89984;"># </span><span style="color: #a89984;">override the datatype of x_data</span>
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Random Tensor: \n {x_rand} \n"</span>)
</pre>
</div></li>
<li><p>
输出如下:
</p>
<pre class="example" id="orgcbd8583">
Ones Tensor:
 tensor([[1, 1],
        [1, 1]])

Random Tensor:
 tensor([[0.7919, 0.3389],
        [0.3505, 0.1489]])
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1c7cbf1" class="outline-4">
<h4 id="org1c7cbf1"><span class="section-number-4">2.1.4</span> With random or constant values:</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>我们可以使用一个tuple来定义tensor的dimensions,然后作为一个参数传递给初始化函数:
<ul class="org-ul">
<li><p>
代码如下:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">shape</span> = (
<span style="background-color: #ebdbb2;"> </span>   2,
<span style="background-color: #ebdbb2;"> </span>   3,
)
<span style="color: #076678;">rand_tensor</span> = torch.rand(shape)
<span style="color: #076678;">ones_tensor</span> = torch.ones(shape)
<span style="color: #076678;">zeros_tensor</span> = torch.zeros(shape)

<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Random Tensor: \n {rand_tensor} \n"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Ones Tensor: \n {ones_tensor} \n"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Zeros Tensor: \n {zeros_tensor} \n"</span>)
</pre>
</div></li>
<li><p>
输出如下:
</p>
<pre class="example" id="orgb75191b">
Random Tensor:
 tensor([[0.6669, 0.3043, 0.1660],
        [0.6319, 0.2304, 0.6747]])

Ones Tensor:
 tensor([[1., 1., 1.],
        [1., 1., 1.]])

Zeros Tensor:
 tensor([[0., 0., 0.],
        [0., 0., 0.]])
</pre></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4555655" class="outline-3">
<h3 id="org4555655"><span class="section-number-3">2.2</span> Attributes of Tensor</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>tensor的attribute描述了他们的shape,datatype,和他们所存储的device
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">tensor</span> = torch.rand(3, 4)

<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Shape of tensor: {tensor.shape}"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Datatype of tensor: {tensor.dtype}"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Device tensor is stored on: {tensor.device}"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgcdc5799">
Shape of tensor: torch.Size([3, 4])
Datatype of tensor: torch.float32
Device tensor is stored on: cpu
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgce4ab38" class="outline-3">
<h3 id="orgce4ab38"><span class="section-number-3">2.3</span> Operations on Tensors</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>tensor支持100多种操作,包括:
<ul class="org-ul">
<li>arithmetic</li>
<li>linear algebra</li>
<li>matrix manipulation(transposing, indexing, slicing)</li>
<li>sampling</li>
</ul></li>
<li><p>
这些操作可以在GPU上面或者CPU上面运行.默认情况下是在cpu运行.如果想在GPU运行,需要明确的使用`to`
函数.需要注意的是跨设备(从CPU到GPU)拷贝tensor是非常expensive的操作,费时间,费内存
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">if</span> torch.cuda.is_available():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">tensor</span> = tensor.to(<span style="color: #79740e;">"cuda"</span>)
</pre>
</div></li>
<li>下面我们列举一些处理数据的api,和NumPy比起来是非常类似的</li>
</ul>
</div>
