introduction-to-pytorch.org
*** Standard numpy-like indexing and slicing
    + 代码如下
      #+begin_src python
        print("Frist row: ", tensor[0])
        print("Frist column: ", tensor[:,0]) # 第一到最后一行的,第0个元素
        print("Last column: ", tensor[...,-1]) # 第一到最后一行的,最后一个元素
        tensor[:,1] = 0
        print(tensor)
      #+end_src
    + 输出如下
      #+begin_example
        Frist row:  tensor([1., 1., 1., 1.])
        Frist column:  tensor([1., 1., 1., 1.])
        Last column:  tensor([1., 1., 1., 1.])
        tensor([[1., 0., 1., 1.],
                [1., 0., 1., 1.],
                [1., 0., 1., 1.],
                [1., 0., 1., 1.]])
      #+end_example
*** Joining tensors
    + 你可以使用torch.cat来concatenate一系列的tensor
      - 代码如下
        #+begin_src python
          t1 = torch.cat([tensor, tensor, tensor], dim=1)
          print(t1)
        #+end_src
      - 输出如下
        #+begin_example
          tensor([[1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.],
                  [1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.],
                  [1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.],
                  [1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.]])
        #+end_example
*** Arithmetic operations
    + 如下操作都可以看做是两个matrix的multiplicaiton
      - 代码如下
        #+begin_src python
          y1 = tensor @ tensor.T
          y2 = tensor.matmul(tensor.T)
          y3 = torch.rand_like(tensor)
          torch.matmul(tensor, tensor.T, out=y3)
          print(y1)
          print(y2)
          print(y3)
        #+end_src
      - 输出如下
        #+begin_example
          tensor([[3., 3., 3., 3.],
                  [3., 3., 3., 3.],
                  [3., 3., 3., 3.],
                  [3., 3., 3., 3.]])
          tensor([[3., 3., 3., 3.],
                  [3., 3., 3., 3.],
                  [3., 3., 3., 3.],
                  [3., 3., 3., 3.]])
          tensor([[3., 3., 3., 3.],
                  [3., 3., 3., 3.],
                  [3., 3., 3., 3.],
                  [3., 3., 3., 3.]])
        #+end_example
    + 如下操作是两个matrix对应item的乘法
      - 代码如下
        #+begin_src python
          z1 = tensor * tensor
          z2 = tensor.mul(tensor)
          z3 = torch.rand_like(tensor)
          torch.mul(tensor, tensor, out=z3)
          print(z1)
          print(z2)
          print(z3)
        #+end_src
      - 输出如下
        #+begin_example
          tensor([[1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.]])
          tensor([[1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.]])
          tensor([[1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.]])
        #+end_example
    + 把一个tensor里面的数据累加到一个数据里面,我们要用到函数item()
      - 代码如下
        #+begin_src python
          agg = tensor.sum()
          agg_item = agg.item()
          print(agg_item, type(agg_item))
        #+end_src
      - 输出如下
        #+begin_example
          12.0 <class 'float'>
        #+end_example
    + 很多时候,我们还希望有in-place的操作,也就是把更改值直接作用到调用对象上面, 这种函数一般以"_"结尾
      - 代码如下
        #+begin_src python
          print(tensor, "\n")
          tensor.add_(5)
          print(tensor)
        #+end_src
      - 输出如下
        #+begin_example
          tensor([[1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.],
                  [1., 0., 1., 1.]])

          tensor([[6., 5., 6., 6.],
                  [6., 5., 6., 6.],
                  [6., 5., 6., 6.],
                  [6., 5., 6., 6.]])
        #+end_example
      - 由于in-place操作会丢失history,所以实践当中不推荐使用
** Bridge with Numpy
   + 在CPU上的时候, Tensor和NumPY array可以共享内存,这也就意味着一个内容改变了,另外一个也会跟着改变
*** Tensor to Numpy array
    + 从tensor到numpy共享内存的例子
      - 代码如下
        #+begin_src python
          t = torch.ones(5)
          print(f"t: {t}")
          n = t.numpy()
          print(f"n: {n}")

          t.add_(1)
          print(f"t: {t}")
          print(f"n: {n}")
        #+end_src
      - 输出如下
        #+begin_example
          t: tensor([1., 1., 1., 1., 1.])
          n: [1. 1. 1. 1. 1.]
          t: tensor([2., 2., 2., 2., 2.])
          n: [2. 2. 2. 2. 2.]
        #+end_example
*** Numpy array to Tensor
    + 从numpy到tensor共享内存的例子
      - 代码如下
        #+begin_src python
          n = np.ones(5)
          t = torch.from_numpy(n)
          print(f"t: {t}")
          print(f"n: {n}")
          np.add(n, 1, out=n)
          print(f"t: {t}")
          print(f"n: {n}")
        #+end_src
      - 输出如下
        #+begin_example
          t: tensor([1., 1., 1., 1., 1.], dtype=torch.float64)
          n: [1. 1. 1. 1. 1.]
          t: tensor([2., 2., 2., 2., 2.], dtype=torch.float64)
          n: [2. 2. 2. 2. 2.]
        #+end_example
* Datasets & Dataloaders
  + 处理data sample的代码可能会非常的麻烦,我们希望我们的dataset 代码和model training 代码区分开,为了
    达到这个目的,pytorch设计了两个data primitive, 这两个primitive可以处理你自己的数据,也可以使用pre-loaded
    的那些公共数据:
    - torch.utils.data.Dataset: 存储sample和sample对应的的label
    - torch.utils.data.DataLoader: 在Dataset的基础上增加了iterable的功能
  + PyTorch为了让用户做实验,内置了很多公共库,比如FashionMNIST,这种公共库都继承了torch.utils.data.Dataset
