introduction-to-pytorch.html
<div id="outline-container-org1ac9655" class="outline-4">
<h4 id="org1ac9655"><span class="section-number-4">2.3.1</span> Standard numpy-like indexing and slicing</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Frist row: "</span>, tensor[0])
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Frist column: "</span>, tensor[:,0]) <span style="color: #a89984;"># </span><span style="color: #a89984;">&#31532;&#19968;&#21040;&#26368;&#21518;&#19968;&#34892;&#30340;,&#31532;0&#20010;&#20803;&#32032;</span>
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Last column: "</span>, tensor[...,-1]) <span style="color: #a89984;"># </span><span style="color: #a89984;">&#31532;&#19968;&#21040;&#26368;&#21518;&#19968;&#34892;&#30340;,&#26368;&#21518;&#19968;&#20010;&#20803;&#32032;</span>
<span style="color: #076678;">tensor</span>[:,1] = 0
<span style="color: #9d0006;">print</span>(tensor)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgf9903e5">
Frist row:  tensor([1., 1., 1., 1.])
Frist column:  tensor([1., 1., 1., 1.])
Last column:  tensor([1., 1., 1., 1.])
tensor([[1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.]])
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-org48f7758" class="outline-4">
<h4 id="org48f7758"><span class="section-number-4">2.3.2</span> Joining tensors</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>你可以使用torch.cat来concatenate一系列的tensor
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">t1</span> = torch.cat([tensor, tensor, tensor], dim=1)
<span style="color: #9d0006;">print</span>(t1)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org5275b37">
tensor([[1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.],
        [1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.],
        [1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.],
        [1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1.]])
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb679c13" class="outline-4">
<h4 id="orgb679c13"><span class="section-number-4">2.3.3</span> Arithmetic operations</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>如下操作都可以看做是两个matrix的multiplicaiton
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">y1</span> = tensor @ tensor.T
<span style="color: #076678;">y2</span> = tensor.matmul(tensor.T)
<span style="color: #076678;">y3</span> = torch.rand_like(tensor)
torch.matmul(tensor, tensor.T, out=y3)
<span style="color: #9d0006;">print</span>(y1)
<span style="color: #9d0006;">print</span>(y2)
<span style="color: #9d0006;">print</span>(y3)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org8a304a2">
tensor([[3., 3., 3., 3.],
        [3., 3., 3., 3.],
        [3., 3., 3., 3.],
        [3., 3., 3., 3.]])
tensor([[3., 3., 3., 3.],
        [3., 3., 3., 3.],
        [3., 3., 3., 3.],
        [3., 3., 3., 3.]])
tensor([[3., 3., 3., 3.],
        [3., 3., 3., 3.],
        [3., 3., 3., 3.],
        [3., 3., 3., 3.]])
</pre></li>
</ul></li>
<li>如下操作是两个matrix对应item的乘法
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">z1</span> = tensor * tensor
<span style="color: #076678;">z2</span> = tensor.mul(tensor)
<span style="color: #076678;">z3</span> = torch.rand_like(tensor)
torch.mul(tensor, tensor, out=z3)
<span style="color: #9d0006;">print</span>(z1)
<span style="color: #9d0006;">print</span>(z2)
<span style="color: #9d0006;">print</span>(z3)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgcabf136">
tensor([[1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.]])
tensor([[1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.]])
tensor([[1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.]])
</pre></li>
</ul></li>
<li>把一个tensor里面的数据累加到一个数据里面,我们要用到函数item()
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">agg</span> = tensor.<span style="color: #af3a03;">sum</span>()
<span style="color: #076678;">agg_item</span> = agg.item()
<span style="color: #9d0006;">print</span>(agg_item, <span style="color: #af3a03;">type</span>(agg_item))
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org7211508">
12.0 &lt;class 'float'&gt;
</pre></li>
</ul></li>
<li>很多时候,我们还希望有in-place的操作,也就是把更改值直接作用到调用对象上面, 这种函数一般以"_"结尾
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">print</span>(tensor, <span style="color: #79740e;">"\n"</span>)
tensor.add_(5)
<span style="color: #9d0006;">print</span>(tensor)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org80b57f4">
tensor([[1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.],
        [1., 0., 1., 1.]])

tensor([[6., 5., 6., 6.],
        [6., 5., 6., 6.],
        [6., 5., 6., 6.],
        [6., 5., 6., 6.]])
</pre></li>
<li>由于in-place操作会丢失history,所以实践当中不推荐使用</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd712754" class="outline-3">
<h3 id="orgd712754"><span class="section-number-3">2.4</span> Bridge with Numpy</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>在CPU上的时候, Tensor和NumPY array可以共享内存,这也就意味着一个内容改变了,另外一个也会跟着改变</li>
</ul>
</div>
<div id="outline-container-org7c471ab" class="outline-4">
<h4 id="org7c471ab"><span class="section-number-4">2.4.1</span> Tensor to Numpy array</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>从tensor到numpy共享内存的例子
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">t</span> = torch.ones(5)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"t: {t}"</span>)
<span style="color: #076678;">n</span> = t.numpy()
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"n: {n}"</span>)

t.add_(1)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"t: {t}"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"n: {n}"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org22329ca">
t: tensor([1., 1., 1., 1., 1.])
n: [1. 1. 1. 1. 1.]
t: tensor([2., 2., 2., 2., 2.])
n: [2. 2. 2. 2. 2.]
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1075845" class="outline-4">
<h4 id="org1075845"><span class="section-number-4">2.4.2</span> Numpy array to Tensor</h4>
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>从numpy到tensor共享内存的例子
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">n</span> = np.ones(5)
<span style="color: #076678;">t</span> = torch.from_numpy(n)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"t: {t}"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"n: {n}"</span>)
np.add(n, 1, out=n)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"t: {t}"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"n: {n}"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgabe58f8">
t: tensor([1., 1., 1., 1., 1.], dtype=torch.float64)
n: [1. 1. 1. 1. 1.]
t: tensor([2., 2., 2., 2., 2.], dtype=torch.float64)
n: [2. 2. 2. 2. 2.]
</pre></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbe3c536" class="outline-2">
<h2 id="orgbe3c536"><span class="section-number-2">3</span> Datasets &amp; Dataloaders</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>处理data sample的代码可能会非常的麻烦,我们希望我们的dataset 代码和model training 代码区分开,为了
达到这个目的,pytorch设计了两个data primitive, 这两个primitive可以处理你自己的数据,也可以使用pre-loaded
的那些公共数据:
<ul class="org-ul">
<li>torch.utils.data.Dataset: 存储sample和sample对应的的label</li>
<li>torch.utils.data.DataLoader: 在Dataset的基础上增加了iterable的功能</li>
</ul></li>
<li>PyTorch为了让用户做实验,内置了很多公共库,比如FashionMNIST,这种公共库都继承了torch.utils.data.Dataset</li>
</ul>
</div>
