introduction-to-pytorch.org
** Loading a Dataset
   + 下面我们就来看看pytorch如何load Fashion-MNIST数据. 这个数据:
     - 有60000个training example
     - 有10000个test example
     - 每个example包含28*28 grayscale image
     - 每个example有对应的label(正确答案)
   + 我们下面的代码用到了如下的变量:
     - root是我们的train/test data存储的地方
     - train代表了training或者test dataset
     - download=True表示我们如果在root没有数据的话,要从互联网下载
     - transform和target_transorm代表feature和label
   + 首先看下载Fashion-MNIST数据集的例子:
     - 代码如下
       #+begin_src python
         import torch

         from torch.utils.data import Dataset
         from torchvision import datasets
         from torchvision.transforms import ToTensor
         import matplotlib.pyplot as plt

         training_data = datasets.FashionMNIST(
             root="data", train=True, download=True, transform=ToTensor()
         )

         test_data = datasets.FashionMNIST(
             root="data", train=False, download=True, transform=ToTensor()
         )
       #+end_src
     - 输出如下
       #+begin_example
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz to data/FashionMNIST/raw/train-images-idx3-ubyte.gz
         100.0%
         Extracting data/FashionMNIST/raw/train-images-idx3-ubyte.gz to data/FashionMNIST/raw

         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw/train-labels-idx1-ubyte.gz
         100.6%
         Extracting data/FashionMNIST/raw/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw

         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz
         100.0%
         Extracting data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw

         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz
         Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz
         119.3%
         Extracting data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw
       #+end_example
** Iterating and Visualizing the Dataset
   + 我们可以像使用其他list一样使用Dataset,比如training_data[index], 我们使用matplotlib来visualize一些数据
     - 代码如下
       #+begin_src python
         labels_map = {
             0: "T-Shirt",
             1: "Trouser",
             2: "Pullover",
             3: "Dress",
             4: "Coat",
             5: "Sandal",
             6: "Shirt",
             7: "Sneaker",
             8: "Bag",
             9: "Ankle Boot",
         }

         figure = plt.figure(figsize=(8, 8))
         cols, rows = 3, 3
         for i in range(1, cols * rows + 1):
             sample_idx = torch.randint(len(training_data), size=(1,)).item()
             print('''[sample_idx] ==>''', sample_idx)
             img, label = training_data[sample_idx]
             figure.add_subplot(rows, cols, i)
             plt.title(labels_map[label])
             plt.axis("off")
             plt.imshow(img.squeeze(), cmap="gray")
         plt.show()
       #+end_src
     - 输出如下
       #+begin_example
         [sample_idx] ==> 56165
         [sample_idx] ==> 46042
         [sample_idx] ==> 19185
         [sample_idx] ==> 57231
         [sample_idx] ==> 41509
         [sample_idx] ==> 57455
         [sample_idx] ==> 7884
         [sample_idx] ==> 30338
         [sample_idx] ==> 40487
       #+end_example
** Creating a Custom Dataset for your files
   + 如果想创建自己的Dataset,那么就要继承torch.utils.data.Dataset,并且实现如下函数:
     - __init__
     - __len__
     - __geitem__
   + 代码如下
     #+begin_src python
       import os
       import pandas as pd
       from torchvision.io import read_image


       class CustomImageDataset(Dataset):
           def __init__(
               self, annotations_file, img_dir, transform=None, target_transform=None
           ):
               self.img_labels = pd.read_csv(annotations_file)
               self.img_dir = img_dir
               self.transform = transform
               self.target_transform = target_transform

           def __len__(self):
               return len(self.img_labels)

           def __getitem__(self, idx):
               img_path = os.path.join(self.img_dir, self.img_labels.iloc[idx, 0])
               image = read_image(img_path)
               label = self.img_labels.iloc[idx, 1]
               if self.transform:
                   image = self.transform(image)
               if self.target_transform:
                   label = self.target_transform(label)
               return image, label
     #+end_src
