introduction-to-pytorch.html
<div id="outline-container-orgf200b11" class="outline-3">
<h3 id="orgf200b11"><span class="section-number-3">3.1</span> Loading a Dataset</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>下面我们就来看看pytorch如何load Fashion-MNIST数据. 这个数据:
<ul class="org-ul">
<li>有60000个training example</li>
<li>有10000个test example</li>
<li>每个example包含28*28 grayscale image</li>
<li>每个example有对应的label(正确答案)</li>
</ul></li>
<li>我们下面的代码用到了如下的变量:
<ul class="org-ul">
<li>root是我们的train/test data存储的地方</li>
<li>train代表了training或者test dataset</li>
<li>download=True表示我们如果在root没有数据的话,要从互联网下载</li>
<li>transform和target_transorm代表feature和label</li>
</ul></li>
<li>首先看下载Fashion-MNIST数据集的例子:
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch

<span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> Dataset
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets
<span style="color: #9d0006;">from</span> torchvision.transforms <span style="color: #9d0006;">import</span> ToTensor
<span style="color: #9d0006;">import</span> matplotlib.pyplot <span style="color: #9d0006;">as</span> plt

<span style="color: #076678;">training_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>, train=<span style="color: #8f3f71;">True</span>, download=<span style="color: #8f3f71;">True</span>, transform=ToTensor()
)

<span style="color: #076678;">test_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>, train=<span style="color: #8f3f71;">False</span>, download=<span style="color: #8f3f71;">True</span>, transform=ToTensor()
)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org22d194f">
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-images-idx3-ubyte.gz to data/FashionMNIST/raw/train-images-idx3-ubyte.gz
100.0%
Extracting data/FashionMNIST/raw/train-images-idx3-ubyte.gz to data/FashionMNIST/raw

Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw/train-labels-idx1-ubyte.gz
100.6%
Extracting data/FashionMNIST/raw/train-labels-idx1-ubyte.gz to data/FashionMNIST/raw

Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz
100.0%
Extracting data/FashionMNIST/raw/t10k-images-idx3-ubyte.gz to data/FashionMNIST/raw

Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz
Downloading http://fashion-mnist.s3-website.eu-central-1.amazonaws.com/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz
119.3%
Extracting data/FashionMNIST/raw/t10k-labels-idx1-ubyte.gz to data/FashionMNIST/raw
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org87dfa63" class="outline-3">
<h3 id="org87dfa63"><span class="section-number-3">3.2</span> Iterating and Visualizing the Dataset</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>我们可以像使用其他list一样使用Dataset,比如training_data[index], 我们使用matplotlib来visualize一些数据
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">labels_map</span> = {
<span style="background-color: #ebdbb2;"> </span>   0: <span style="color: #79740e;">"T-Shirt"</span>,
<span style="background-color: #ebdbb2;"> </span>   1: <span style="color: #79740e;">"Trouser"</span>,
<span style="background-color: #ebdbb2;"> </span>   2: <span style="color: #79740e;">"Pullover"</span>,
<span style="background-color: #ebdbb2;"> </span>   3: <span style="color: #79740e;">"Dress"</span>,
<span style="background-color: #ebdbb2;"> </span>   4: <span style="color: #79740e;">"Coat"</span>,
<span style="background-color: #ebdbb2;"> </span>   5: <span style="color: #79740e;">"Sandal"</span>,
<span style="background-color: #ebdbb2;"> </span>   6: <span style="color: #79740e;">"Shirt"</span>,
<span style="background-color: #ebdbb2;"> </span>   7: <span style="color: #79740e;">"Sneaker"</span>,
<span style="background-color: #ebdbb2;"> </span>   8: <span style="color: #79740e;">"Bag"</span>,
<span style="background-color: #ebdbb2;"> </span>   9: <span style="color: #79740e;">"Ankle Boot"</span>,
}

<span style="color: #076678;">figure</span> = plt.figure(figsize=(8, 8))
<span style="color: #076678;">cols</span>, <span style="color: #076678;">rows</span> = 3, 3
<span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">range</span>(1, cols * rows + 1):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">sample_idx</span> = torch.randint(<span style="color: #af3a03;">len</span>(training_data), size=(1,)).item()
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'''[sample_idx] ==&gt;'''</span>, sample_idx)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">img</span>, <span style="color: #076678;">label</span> = training_data[sample_idx]
<span style="background-color: #ebdbb2;"> </span>   figure.add_subplot(rows, cols, i)
<span style="background-color: #ebdbb2;"> </span>   plt.title(labels_map[label])
<span style="background-color: #ebdbb2;"> </span>   plt.axis(<span style="color: #79740e;">"off"</span>)
<span style="background-color: #ebdbb2;"> </span>   plt.imshow(img.squeeze(), cmap=<span style="color: #79740e;">"gray"</span>)
plt.show()
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgf7faf2e">
[sample_idx] ==&gt; 56165
[sample_idx] ==&gt; 46042
[sample_idx] ==&gt; 19185
[sample_idx] ==&gt; 57231
[sample_idx] ==&gt; 41509
[sample_idx] ==&gt; 57455
[sample_idx] ==&gt; 7884
[sample_idx] ==&gt; 30338
[sample_idx] ==&gt; 40487
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3f074e9" class="outline-3">
<h3 id="org3f074e9"><span class="section-number-3">3.3</span> Creating a Custom Dataset for your files</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>如果想创建自己的Dataset,那么就要继承torch.utils.data.Dataset,并且实现如下函数:
<ul class="org-ul">
<li>__init__</li>
<li>__len__</li>
<li>__geitem__</li>
</ul></li>
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> os
<span style="color: #9d0006;">import</span> pandas <span style="color: #9d0006;">as</span> pd
<span style="color: #9d0006;">from</span> torchvision.io <span style="color: #9d0006;">import</span> read_image


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">CustomImageDataset</span>(Dataset):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>, annotations_file, img_dir, transform=<span style="color: #8f3f71;">None</span>, target_transform=<span style="color: #8f3f71;">None</span>
<span style="background-color: #ebdbb2;"> </span>   ):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.img_labels = pd.read_csv(annotations_file)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.img_dir = img_dir
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.transform = transform
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.target_transform = target_transform

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__len__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> <span style="color: #af3a03;">len</span>(<span style="color: #9d0006;">self</span>.img_labels)

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__getitem__</span>(<span style="color: #9d0006;">self</span>, idx):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">img_path</span> = os.path.join(<span style="color: #9d0006;">self</span>.img_dir, <span style="color: #9d0006;">self</span>.img_labels.iloc[idx, 0])
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">image</span> = read_image(img_path)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">label</span> = <span style="color: #9d0006;">self</span>.img_labels.iloc[idx, 1]
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">if</span> <span style="color: #9d0006;">self</span>.transform:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">image</span> = <span style="color: #9d0006;">self</span>.transform(image)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">if</span> <span style="color: #9d0006;">self</span>.target_transform:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">label</span> = <span style="color: #9d0006;">self</span>.target_transform(label)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> image, label
</pre>
</div></li>
</ul>
</div>
