introduction-to-pytorch.org
*** __init__
    + __init__函数会在Dataset对象实例化的时候运行一次,参数解释如下:
      - annotations_file: 一个csv文件,里面存放image文件和label的对应关系,例子如下
        #+begin_example
          tshirt1.jpg, 0
          tshirt2.jpg, 0
          ......
          ankleboot999.jpg, 9
        #+end_example
      - img_dir:放置图片的文件夹
*** __len__
    + __len__返回sample的总数,也就是label的总数
*** __getitem__
    + __getitem__返回在idx位置的sample
    + 根据idx,我们要:
      1) 判断出image的disk位置,转换成tensor(使用read_image)
      2) 并且要获得这个image的label
      3) 如果需要还要调用transform函数
      4) 以tuple的形式返回(tensor_image, corresponding_label)
** Preparing your data for training with DataLoaders
   + Dataset每次取一个sample,但是在训练的时候,我们会有如下多个sample一起取的需求:
     - 以minibatch的方法取一批sample
     - 每个epoch都会reshuffle数据来减小overfitting
     - 使用Python的multiprocessing来加速数据获取
   + DataLoader就是为了上面的需求而设计的iterable的Dataset
     #+begin_src python
       from torch.utils.data import DataLoader

       train_dataloader = DataLoader(training_data, batch_size=64, shuffle=True)
       test_dataloader = DataLoader(test_data, batch_size=64, shuffle=True)
     #+end_src
** Iterate through the DataLoader
   + 我们使用DataLoader就可以使用next来循环了
   + 返回的两个对象,train_feature和train_label都是包含64个成员
   + 由于我们设置了shuffle=True,所以我们每次循环之后,所有的batch都会重新洗牌
     - 代码如下
       #+begin_src python
         # Display image and label.
         train_features, train_labels = next(iter(train_dataloader))
         print(f"Feature batch shape: {train_features.size()}")
         print(f"Label batch shape: {train_labels.size()}")
         img = train_features[0].squeeze()
         label = train_labels[0]
         plt.imshow(img, cmap="gray")
         plt.show()
         print(f"Label: {label}")
       #+end_src
     - 输出如下
       #+begin_example
         Feature batch shape: torch.Size([64, 1, 28, 28])
         Label batch shape: torch.Size([64])
         Label: 7
       #+end_example
* Transforms
  + 网上的数据,或者我们提供的数据,并不一定是我们训练的时候需要的格式(或者不同的训练可能会需要不同的格
    式),那么在下载之后,使用之前,我们要做一些转换,在pytorch这里,这个转换叫做transforms
  + 所有的TorchVision dataset都有两个参数:
    - transform用来修改feature的格式
    - target_transform用来修改label的格式
  + 以FashionMNIST为例:
    - feature都是PIL 格式,我们需要把feature都转成normalized tensor
    - label都是integer格式,我们需要把label转成one-hot encoded tensor
    - 代码如下
      #+begin_src python
        import torch
        from torchvision import datasets
        from torchvision.transforms import ToTensor, Lambda

        ds = datasets.FashionMNIST(
            root="data",
            train=True,
            download=True,
            transform=ToTensor(),
            target_transform=Lambda(
                lambda y: torch.zeros(10, dtype=torch.float).scatter_(
                    0, torch.tensor(y), value=1
                )
            ),
        )
      #+end_src
** ToTensor()
   + ToTensor会把PIL image(或者NumPy ndarray)转换成FloatTensor,并且把image的pixel intensity控制在[0,1]
     之间
** Lambda Transforms
   + 如果没有ToTensor这种函数,那么我们需要自己创建一个函数来作为transform,Lambda是一种临时只用一次的函数
   + 这里的Lambda函数:
     - 首选会创建一个长度为10的zero tensor
     - 然后调用scatter_来给这个tensor的某个index赋值为1
* Build The Neural Network
  + Neural network(神经网络)在pytorch里面叫一个module.
  + 每个module要么包含其他module,要么就是最底层的module,这个module包含很多layer,这些layer分别对data
    做operation. 两者相互关系如下:
    #+begin_example
      moduleA
      |-- moduleB
      |   `-- LayerA
      `-- moduleC
          |-- LayerB
          `-- LayerC
    #+end_example
  + pytorch里面,所有的和neural network相关的building block都在torch.nn这个namespace下面
  + pytorch里面的module都继承自nn.Module
  + 本章需要的头文件如下
    #+begin_src python
      import os
      import torch
      from torch import nn
      from torch.utils.data import DataLoader
      from torchvision import datasets, transforms
    #+end_src
** Get Device for Training
   + 如果cuda存在,可以使用显卡来训练,否则使用cpu来训练
     #+begin_src python
       device = "cuda" if torch.cuda.is_available() else "cpu"
       print("Using {} device".format(device))
     #+end_src
