introduction-to-pytorch.html
<div id="outline-container-org4aa0077" class="outline-4">
<h4 id="org4aa0077"><span class="section-number-4">3.3.1</span> __init__</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>__init__函数会在Dataset对象实例化的时候运行一次,参数解释如下:
<ul class="org-ul">
<li><p>
annotations_file: 一个csv文件,里面存放image文件和label的对应关系,例子如下
</p>
<pre class="example" id="org8f07bb7">
tshirt1.jpg, 0
tshirt2.jpg, 0
......
ankleboot999.jpg, 9
</pre></li>
<li>img_dir:放置图片的文件夹</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb23d5f2" class="outline-4">
<h4 id="orgb23d5f2"><span class="section-number-4">3.3.2</span> __len__</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>__len__返回sample的总数,也就是label的总数</li>
</ul>
</div>
</div>
<div id="outline-container-orgf6d3144" class="outline-4">
<h4 id="orgf6d3144"><span class="section-number-4">3.3.3</span> __getitem__</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li>__getitem__返回在idx位置的sample</li>
<li>根据idx,我们要:
<ol class="org-ol">
<li>判断出image的disk位置,转换成tensor(使用read_image)</li>
<li>并且要获得这个image的label</li>
<li>如果需要还要调用transform函数</li>
<li>以tuple的形式返回(tensor_image, corresponding_label)</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgab32d67" class="outline-3">
<h3 id="orgab32d67"><span class="section-number-3">3.4</span> Preparing your data for training with DataLoaders</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Dataset每次取一个sample,但是在训练的时候,我们会有如下多个sample一起取的需求:
<ul class="org-ul">
<li>以minibatch的方法取一批sample</li>
<li>每个epoch都会reshuffle数据来减小overfitting</li>
<li>使用Python的multiprocessing来加速数据获取</li>
</ul></li>
<li><p>
DataLoader就是为了上面的需求而设计的iterable的Dataset
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> DataLoader

<span style="color: #076678;">train_dataloader</span> = DataLoader(training_data, batch_size=64, shuffle=<span style="color: #8f3f71;">True</span>)
<span style="color: #076678;">test_dataloader</span> = DataLoader(test_data, batch_size=64, shuffle=<span style="color: #8f3f71;">True</span>)
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd5216d" class="outline-3">
<h3 id="orgdd5216d"><span class="section-number-3">3.5</span> Iterate through the DataLoader</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>我们使用DataLoader就可以使用next来循环了</li>
<li>返回的两个对象,train_feature和train_label都是包含64个成员</li>
<li>由于我们设置了shuffle=True,所以我们每次循环之后,所有的batch都会重新洗牌
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a89984;"># </span><span style="color: #a89984;">Display image and label.</span>
<span style="color: #076678;">train_features</span>, <span style="color: #076678;">train_labels</span> = <span style="color: #af3a03;">next</span>(<span style="color: #af3a03;">iter</span>(train_dataloader))
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Feature batch shape: {train_features.size()}"</span>)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Label batch shape: {train_labels.size()}"</span>)
<span style="color: #076678;">img</span> = train_features[0].squeeze()
<span style="color: #076678;">label</span> = train_labels[0]
plt.imshow(img, cmap=<span style="color: #79740e;">"gray"</span>)
plt.show()
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Label: {label}"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgf112e36">
Feature batch shape: torch.Size([64, 1, 28, 28])
Label batch shape: torch.Size([64])
Label: 7
</pre></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6ce1712" class="outline-2">
<h2 id="org6ce1712"><span class="section-number-2">4</span> Transforms</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>网上的数据,或者我们提供的数据,并不一定是我们训练的时候需要的格式(或者不同的训练可能会需要不同的格
式),那么在下载之后,使用之前,我们要做一些转换,在pytorch这里,这个转换叫做transforms</li>
<li>所有的TorchVision dataset都有两个参数:
<ul class="org-ul">
<li>transform用来修改feature的格式</li>
<li>target_transform用来修改label的格式</li>
</ul></li>
<li>以FashionMNIST为例:
<ul class="org-ul">
<li>feature都是PIL 格式,我们需要把feature都转成normalized tensor</li>
<li>label都是integer格式,我们需要把label转成one-hot encoded tensor</li>
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets
<span style="color: #9d0006;">from</span> torchvision.transforms <span style="color: #9d0006;">import</span> ToTensor, Lambda

<span style="color: #076678;">ds</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>,
<span style="background-color: #ebdbb2;"> </span>   train=<span style="color: #8f3f71;">True</span>,
<span style="background-color: #ebdbb2;"> </span>   download=<span style="color: #8f3f71;">True</span>,
<span style="background-color: #ebdbb2;"> </span>   transform=ToTensor(),
<span style="background-color: #ebdbb2;"> </span>   target_transform=Lambda(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">lambda</span> y: torch.zeros(10, dtype=torch.<span style="color: #af3a03;">float</span>).scatter_(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   0, torch.tensor(y), value=1
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   )
<span style="background-color: #ebdbb2;"> </span>   ),
)
</pre>
</div></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org07bcbf3" class="outline-3">
<h3 id="org07bcbf3"><span class="section-number-3">4.1</span> ToTensor()</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>ToTensor会把PIL image(或者NumPy ndarray)转换成FloatTensor,并且把image的pixel intensity控制在[0,1]
之间</li>
</ul>
</div>
</div>
<div id="outline-container-org68e0198" class="outline-3">
<h3 id="org68e0198"><span class="section-number-3">4.2</span> Lambda Transforms</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>如果没有ToTensor这种函数,那么我们需要自己创建一个函数来作为transform,Lambda是一种临时只用一次的函数</li>
<li>这里的Lambda函数:
<ul class="org-ul">
<li>首选会创建一个长度为10的zero tensor</li>
<li>然后调用scatter_来给这个tensor的某个index赋值为1</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb55af80" class="outline-2">
<h2 id="orgb55af80"><span class="section-number-2">5</span> Build The Neural Network</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Neural network(神经网络)在pytorch里面叫一个module.</li>
<li><p>
每个module要么包含其他module,要么就是最底层的module,这个module包含很多layer,这些layer分别对data
做operation. 两者相互关系如下:
</p>
<pre class="example" id="org929b072">
moduleA
|-- moduleB
|   `-- LayerA
`-- moduleC
    |-- LayerB
    `-- LayerC
</pre></li>
<li>pytorch里面,所有的和neural network相关的building block都在torch.nn这个namespace下面</li>
<li>pytorch里面的module都继承自nn.Module</li>
<li><p>
本章需要的头文件如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> os
<span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">from</span> torch <span style="color: #9d0006;">import</span> nn
<span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> DataLoader
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets, transforms
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-org9f34a34" class="outline-3">
<h3 id="org9f34a34"><span class="section-number-3">5.1</span> Get Device for Training</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><p>
如果cuda存在,可以使用显卡来训练,否则使用cpu来训练
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">device</span> = <span style="color: #79740e;">"cuda"</span> <span style="color: #9d0006;">if</span> torch.cuda.is_available() <span style="color: #9d0006;">else</span> <span style="color: #79740e;">"cpu"</span>
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Using {} device"</span>.<span style="color: #af3a03;">format</span>(device))
</pre>
</div></li>
</ul>
</div>
</div>
