introduction-to-pytorch.html
<div id="outline-container-orgc267249" class="outline-3">
<h3 id="orgc267249"><span class="section-number-3">5.2</span> Define the Class</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>我们自己的神经网络继承自nn.Module:
<ul class="org-ul">
<li>通过__init__初始化neural network</li>
<li>通过实现forward函数来实现对input data的操作</li>
</ul></li>
<li><p>
创建神经网络代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">NeuralNetwork</span>(nn.Module):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #af3a03;">super</span>(NeuralNetwork, <span style="color: #9d0006;">self</span>).__init__()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.flatten = nn.Flatten()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.linear_relu_stack = nn.Sequential(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(28 * 28, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 10),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   )

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">forward</span>(<span style="color: #9d0006;">self</span>, x):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">x</span> = <span style="color: #9d0006;">self</span>.flatten(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">logits</span> = <span style="color: #9d0006;">self</span>.linear_relu_stack(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> logits

</pre>
</div></li>
<li>神经网络代码创建后,可以打印出来,表示我们的model创建成功了,效果如下:
<ul class="org-ul">
<li><p>
代码
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">model</span> = NeuralNetwork().to(device)
<span style="color: #9d0006;">print</span>(model)
</pre>
</div></li>
<li><p>
输出
</p>
<pre class="example" id="org81f05db">
NeuralNetwork(
  (flatten): Flatten(start_dim=1, end_dim=-1)
  (linear_relu_stack): Sequential(
    (0): Linear(in_features=784, out_features=512, bias=True)
    (1): ReLU()
    (2): Linear(in_features=512, out_features=512, bias=True)
    (3): ReLU()
    (4): Linear(in_features=512, out_features=10, bias=True)
  )
)
</pre></li>
</ul></li>
<li>创建model之后,我们要开始使用model了,在pytorch里面,model是一个继承自nn.Module的class,但是,由于它
实现了__call__,所以是callable的,直接把model当函数使用就可以了,参数是input data:
<ul class="org-ul">
<li><p>
代码如下:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">X</span> = torch.rand(1, 28, 28, device=device)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"X&gt;"</span>, X)
<span style="color: #076678;">logits</span> = model(X)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"logits&gt;"</span>, logits)
</pre>
</div></li>
<li><p>
输出如下:
</p>
<pre class="example" id="org5672a7b">
X&gt; tensor([[[3.4855e-01, 2.2404e-01, 9.4086e-04, 9.5183e-01, 6.4413e-01,
          6.3813e-01, 2.9121e-01, 2.7684e-01, 7.4389e-01, 7.8992e-01,
          1.1403e-01, 3.6536e-01, 8.8994e-01, 1.5893e-01, 7.1634e-01,
          4.5617e-01, 9.4580e-01, 5.7355e-01, 5.2298e-01, 6.5089e-01,
          6.2488e-01, 7.5967e-01, 5.6150e-01, 3.3489e-01, 6.6690e-01,
          3.4567e-01, 8.5913e-01, 9.1230e-01],
         [5.5698e-01, 5.6784e-01, 6.7565e-01, 1.1774e-01, 9.3881e-01,
          6.7115e-01, 7.1790e-01, 1.5813e-01, 1.0446e-01, 8.2648e-02,
          1.6147e-01, 8.2475e-01, 8.3832e-01, 9.9920e-01, 4.1542e-01,
          3.3176e-01, 2.5911e-01, 6.8579e-01, 1.9526e-01, 5.8544e-01,
          7.4770e-01, 6.9535e-01, 9.8096e-01, 1.5287e-01, 6.6194e-01,
          9.0889e-01, 8.8180e-01, 5.2309e-01],
          ...
         [6.6676e-01, 5.1000e-01, 3.9123e-01, 6.8837e-03, 9.5137e-01,
          6.5119e-01, 9.5212e-01, 4.0678e-01, 4.6109e-02, 1.5674e-01,
          4.6521e-01, 2.0206e-01, 8.5580e-01, 5.1843e-01, 1.8716e-01,
          1.0377e-03, 3.9218e-01, 5.4533e-01, 1.7358e-01, 5.1870e-01,
          9.3065e-01, 7.2249e-01, 7.2775e-01, 7.2690e-01, 7.4644e-01,
          8.2682e-01, 4.8469e-01, 5.6445e-01]]])
logits&gt; tensor([[ 0.0330, -0.0429,  0.0134,  0.0410,  0.0819,  0.0849,  0.0231, -0.0021,
         -0.0254, -0.0529]], grad_fn=&lt;AddmmBackward&gt;)
</pre></li>
<li>X也就是我们的input,是一个28*28的tensor</li>
<li>logits就是我们model对这个input的预测结果,这个预测结果是raw的predicted value,每个value表示每种
分类的可能性,比如,分类1的可能性是0.0330, 分类2的可能性是-0.0429</li>
</ul></li>
<li>raw的可能性有负值,而且和并不是1,所以需要使用其他方法修正为和为1的概率分布
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">pred_probab</span> = nn.Softmax(dim=1)(logits)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"pred_probab&gt;"</span>, pred_probab)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org44c8c08">
pred_probab&gt; tensor([[0.1017, 0.0942, 0.0997, 0.1025, 0.1068, 0.1071, 0.1007, 0.0982, 0.0959,
         0.0933]], grad_fn=&lt;SoftmaxBackward&gt;)
</pre></li>
</ul></li>
<li>这里的Softmax也是一个module:
<ul class="org-ul">
<li>继承自nn.Module</li>
<li>通常作为神经网络的最后一个activation function来正则化输出.</li>
<li>这里的dim是dimension的缩写,是说针对哪个维度来进行正则化:
<ol class="org-ol">
<li><p>
针对列: 每一列所有概率加起来是1
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">y1</span> = F.softmax(x, dim=0)
<span style="color: #9d0006;">print</span>(y1)
<span style="color: #a89984;"># </span><span style="color: #a89984;">&lt;===================OUTPUT===================&gt;</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">tensor([[0.3333, 0.3333, 0.3333, 0.3333],</span>
<span style="color: #a89984;">#         </span><span style="color: #a89984;">[0.3333, 0.3333, 0.3333, 0.3333],</span>
<span style="color: #a89984;">#         </span><span style="color: #a89984;">[0.3333, 0.3333, 0.3333, 0.3333]])</span>

</pre>
</div></li>
<li><p>
针对行: 每一行所有概率加起来是1
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">y2</span> = F.softmax(x, dim=1)
<span style="color: #9d0006;">print</span>(y2)
<span style="color: #a89984;"># </span><span style="color: #a89984;">&lt;===================OUTPUT===================&gt;</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">tensor([[0.0321, 0.0871, 0.2369, 0.6439],</span>
<span style="color: #a89984;">#         </span><span style="color: #a89984;">[0.0321, 0.0871, 0.2369, 0.6439],</span>
<span style="color: #a89984;">#         </span><span style="color: #a89984;">[0.0321, 0.0871, 0.2369, 0.6439]])</span>
</pre>
</div></li>
</ol></li>
</ul></li>
<li>最后输出tensor里面最大的一个index,这里使用了numpy里面的argmax来寻找醉倒index的值
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">y_pred</span> = pred_probab.argmax(1)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Predicted class: {y_pred}"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgbdee6d5">
Predicted class: tensor([5])
</pre></li>
</ul></li>
</ul>
</div>
</div>
