introduction-to-pytorch.org
** Model Layers
   + 我们使用额外的代码来了解下layer是如何组织的
   + 首先,我们使用随机的方式生成一个image
     - 代码如下
       #+begin_src python
         input_image = torch.rand(3, 4, 5)
         print("""[input_image] ==>""", input_image)
         print("""[input_image.size()] ==>""", input_image.size())
       #+end_src
     - 输出如下
       #+begin_example
         [input_image] ==> tensor([[[0.1550, 0.1822, 0.0137, 0.9355, 0.8929],
                  [0.8082, 0.2442, 0.7184, 0.0184, 0.0828],
                  [0.1097, 0.8672, 0.9809, 0.0283, 0.5656],
                  [0.8645, 0.2560, 0.2821, 0.0864, 0.2733]],

                 [[0.4551, 0.2518, 0.7734, 0.8949, 0.0994],
                  [0.6500, 0.3321, 0.3630, 0.1329, 0.8804],
                  [0.1265, 0.1371, 0.5087, 0.7530, 0.1164],
                  [0.0825, 0.6535, 0.6242, 0.1958, 0.1738]],

                 [[0.1569, 0.3409, 0.7097, 0.9930, 0.4367],
                  [0.0491, 0.4994, 0.8175, 0.8694, 0.2794],
                  [0.3276, 0.8073, 0.9999, 0.0745, 0.6946],
                  [0.4413, 0.6856, 0.1619, 0.5948, 0.5922]]])
         [input_image.size()] ==> torch.Size([3, 4, 5])
       #+end_example
*** nn.Flatten
    + 我们上面是一个3*4*5的三维矩阵,其实每个image是4*5的,所以我们其实想要一个3个像素为20的image,换句
      话说,就是3*4*5矩阵的第一个dimension(dim=0)保留,剩下的打平
      - 代码如下
        #+begin_src python
          flatten = nn.Flatten()
          flat_image = flatten(input_image)
          print("""[flat_image] ==>""", flat_image)
          print("""[flat_image.size()] ==>""", flat_image.size())
        #+end_src
      - 输出如下
        #+begin_example
          [flat_image] ==> tensor([[0.1550, 0.1822, 0.0137, 0.9355, 0.8929, 0.8082, 0.2442, 0.7184, 0.0184,
                   0.0828, 0.1097, 0.8672, 0.9809, 0.0283, 0.5656, 0.8645, 0.2560, 0.2821,
                   0.0864, 0.2733],
                  [0.4551, 0.2518, 0.7734, 0.8949, 0.0994, 0.6500, 0.3321, 0.3630, 0.1329,
                   0.8804, 0.1265, 0.1371, 0.5087, 0.7530, 0.1164, 0.0825, 0.6535, 0.6242,
                   0.1958, 0.1738],
                  [0.1569, 0.3409, 0.7097, 0.9930, 0.4367, 0.0491, 0.4994, 0.8175, 0.8694,
                   0.2794, 0.3276, 0.8073, 0.9999, 0.0745, 0.6946, 0.4413, 0.6856, 0.1619,
                   0.5948, 0.5922]])
          [flat_image.size()] ==> torch.Size([3, 20])
        #+end_example
*** nn.Linear
    + 现在我们获得了3个像素为20(也就是20个float值)的input数据,如果我们想把每个input数据(20像素)映射成
      一个6像素的数据,那么我们就需要linear transformation
    + pytorch为我们准备了这样的linear transformation: nn.Linear
      - 接入代码如下
        #+begin_src python
          layer1 = nn.Linear(in_features=4 * 5, out_features=6)
          hidden1 = layer1(flat_image)
          print("""[hidden1] ==>""", hidden1)
          print("""[hidden1.size()] ==>""", hidden1.size())
        #+end_src
      - 输出如下
        #+begin_example
          [hidden1] ==> tensor([[ 0.0794,  0.5231, -0.2751,  0.3251, -0.1497,  0.2084],
                  [ 0.0444,  0.3368, -0.2555,  0.3189, -0.0683,  0.1535],
                  [-0.0784,  0.6062, -0.8009,  0.4397,  0.0825,  0.1439]],
                 grad_fn=<AddmmBackward>)
          [hidden1.size()] ==> torch.Size([3, 6])
        #+end_example
*** nn.ReLU
    + ReLU是一种activation,所谓activation,是用来引入复杂的(非线性)的规则的
    + activation通常在Linear transformation之后,帮助神经网络学习更复杂的规律(非线性规律)
    + 这里的ReLU是最常见的一个activation,就是说负数的话就映射为0,正数就是保持原来的值:
      - 公式如下:
        \begin{equation}
        ReLU(x) = max(0,x)
        \end{equation}
      - 接入代码如下
        #+begin_src python
          print(f"Before ReLU: {hidden1}\n\n")
          hidden1 = nn.ReLU()(hidden1)
          print(f"After ReLU: {hidden1}")
        #+end_src
      - 输出如下
        #+begin_example
          Before ReLU: tensor([[ 0.0794,  0.5231, -0.2751,  0.3251, -0.1497,  0.2084],
                  [ 0.0444,  0.3368, -0.2555,  0.3189, -0.0683,  0.1535],
                  [-0.0784,  0.6062, -0.8009,  0.4397,  0.0825,  0.1439]],
                 grad_fn=<AddmmBackward>)


          After ReLU: tensor([[0.0794, 0.5231, 0.0000, 0.3251, 0.0000, 0.2084],
                  [0.0444, 0.3368, 0.0000, 0.3189, 0.0000, 0.1535],
                  [0.0000, 0.6062, 0.0000, 0.4397, 0.0825, 0.1439]],
                 grad_fn=<ReluBackward0>)
        #+end_example
*** nn.Sequential
    + 我们来看看刚才的过程:
      1) 首先是3*(4*5)的三个raw input
      2) 第一个module: flatten, 输入是3*(4*5),输出是3*20
      3) 第二个module: nn.Linear(layer1), 输入是3*20,输出是3*6
      4) 第三个module: nn.ReLU, 输入是3*6,输出还是3*6,所有负数都变成了零
    + 我们可以把上面的四个过程统一使用一个module处理,就是nn.Sequential:
      - 代码如下,我们最后还多了一层,把output定格为了7
        #+begin_src python
          seq_modules = nn.Sequential(flatten, layer1, nn.ReLU(), nn.Linear(6, 7))

          input_image = torch.rand(3, 4, 5)
          logits = seq_modules(input_image)

          print("""[logits] ==>""", logits)
          print("""[logits.size()] ==>""", logits.size())
        #+end_src
      - 输出如下
        #+begin_example
          [logits] ==> tensor([[-2.6497e-01, -9.1267e-02,  6.0936e-02, -1.5278e-02, -3.5053e-01,
                    8.0587e-02, -2.1164e-01],
                  [-2.3255e-01, -4.9769e-02,  3.9146e-02,  5.0154e-02, -4.0463e-01,
                    3.8066e-04, -1.5409e-01],
                  [-4.0593e-01, -2.6705e-01, -5.0617e-02, -7.1221e-02, -3.6326e-01,
                   -1.1169e-01,  2.1804e-02]], grad_fn=<AddmmBackward>)
          [logits.size()] ==> torch.Size([3, 7])
        #+end_example
*** nn.Softmax
    + 为了让我们的分类问题最后的7个output能够满足一个概率分布,他们7个的概率和必须是1,所以要使用module:
      nn.Softmax:
      - 代码如下
        #+begin_src python
          softmax = nn.Softmax(dim=1)
          pred_probab = softmax(logits)
          print("""[pred_probab] ==>""", pred_probab)

        #+end_src
      - 输出如下
        #+begin_example
          [pred_probab] ==> tensor([[0.1213, 0.1443, 0.1680, 0.1557, 0.1114, 0.1714, 0.1279],
                  [0.1246, 0.1496, 0.1635, 0.1653, 0.1049, 0.1573, 0.1348],
                  [0.1125, 0.1292, 0.1604, 0.1572, 0.1174, 0.1509, 0.1725]],
                 grad_fn=<SoftmaxBackward>)
        #+end_example
