introduction-to-pytorch.html
<div id="outline-container-org22fc26e" class="outline-3">
<h3 id="org22fc26e"><span class="section-number-3">5.3</span> Model Layers</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>我们使用额外的代码来了解下layer是如何组织的</li>
<li>首先,我们使用随机的方式生成一个image
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">input_image</span> = torch.rand(3, 4, 5)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[input_image] ==&gt;"""</span>, input_image)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[input_image.size()] ==&gt;"""</span>, input_image.size())
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org93ba945">
[input_image] ==&gt; tensor([[[0.1550, 0.1822, 0.0137, 0.9355, 0.8929],
         [0.8082, 0.2442, 0.7184, 0.0184, 0.0828],
         [0.1097, 0.8672, 0.9809, 0.0283, 0.5656],
         [0.8645, 0.2560, 0.2821, 0.0864, 0.2733]],

        [[0.4551, 0.2518, 0.7734, 0.8949, 0.0994],
         [0.6500, 0.3321, 0.3630, 0.1329, 0.8804],
         [0.1265, 0.1371, 0.5087, 0.7530, 0.1164],
         [0.0825, 0.6535, 0.6242, 0.1958, 0.1738]],

        [[0.1569, 0.3409, 0.7097, 0.9930, 0.4367],
         [0.0491, 0.4994, 0.8175, 0.8694, 0.2794],
         [0.3276, 0.8073, 0.9999, 0.0745, 0.6946],
         [0.4413, 0.6856, 0.1619, 0.5948, 0.5922]]])
[input_image.size()] ==&gt; torch.Size([3, 4, 5])
</pre></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org8ff46b1" class="outline-4">
<h4 id="org8ff46b1"><span class="section-number-4">5.3.1</span> nn.Flatten</h4>
<div class="outline-text-4" id="text-5-3-1">
<ul class="org-ul">
<li>我们上面是一个3*4*5的三维矩阵,其实每个image是4*5的,所以我们其实想要一个3个像素为20的image,换句
话说,就是3*4*5矩阵的第一个dimension(dim=0)保留,剩下的打平
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">flatten</span> = nn.Flatten()
<span style="color: #076678;">flat_image</span> = flatten(input_image)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[flat_image] ==&gt;"""</span>, flat_image)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[flat_image.size()] ==&gt;"""</span>, flat_image.size())
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orga1de7a5">
[flat_image] ==&gt; tensor([[0.1550, 0.1822, 0.0137, 0.9355, 0.8929, 0.8082, 0.2442, 0.7184, 0.0184,
         0.0828, 0.1097, 0.8672, 0.9809, 0.0283, 0.5656, 0.8645, 0.2560, 0.2821,
         0.0864, 0.2733],
        [0.4551, 0.2518, 0.7734, 0.8949, 0.0994, 0.6500, 0.3321, 0.3630, 0.1329,
         0.8804, 0.1265, 0.1371, 0.5087, 0.7530, 0.1164, 0.0825, 0.6535, 0.6242,
         0.1958, 0.1738],
        [0.1569, 0.3409, 0.7097, 0.9930, 0.4367, 0.0491, 0.4994, 0.8175, 0.8694,
         0.2794, 0.3276, 0.8073, 0.9999, 0.0745, 0.6946, 0.4413, 0.6856, 0.1619,
         0.5948, 0.5922]])
[flat_image.size()] ==&gt; torch.Size([3, 20])
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orged00327" class="outline-4">
<h4 id="orged00327"><span class="section-number-4">5.3.2</span> nn.Linear</h4>
<div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li>现在我们获得了3个像素为20(也就是20个float值)的input数据,如果我们想把每个input数据(20像素)映射成
一个6像素的数据,那么我们就需要linear transformation</li>
<li>pytorch为我们准备了这样的linear transformation: nn.Linear
<ul class="org-ul">
<li><p>
接入代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">layer1</span> = nn.Linear(in_features=4 * 5, out_features=6)
<span style="color: #076678;">hidden1</span> = layer1(flat_image)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[hidden1] ==&gt;"""</span>, hidden1)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[hidden1.size()] ==&gt;"""</span>, hidden1.size())
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org0d667f9">
[hidden1] ==&gt; tensor([[ 0.0794,  0.5231, -0.2751,  0.3251, -0.1497,  0.2084],
        [ 0.0444,  0.3368, -0.2555,  0.3189, -0.0683,  0.1535],
        [-0.0784,  0.6062, -0.8009,  0.4397,  0.0825,  0.1439]],
       grad_fn=&lt;AddmmBackward&gt;)
[hidden1.size()] ==&gt; torch.Size([3, 6])
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb0d9a9a" class="outline-4">
<h4 id="orgb0d9a9a"><span class="section-number-4">5.3.3</span> nn.ReLU</h4>
<div class="outline-text-4" id="text-5-3-3">
<ul class="org-ul">
<li>ReLU是一种activation,所谓activation,是用来引入复杂的(非线性)的规则的</li>
<li>activation通常在Linear transformation之后,帮助神经网络学习更复杂的规律(非线性规律)</li>
<li>这里的ReLU是最常见的一个activation,就是说负数的话就映射为0,正数就是保持原来的值:
<ul class="org-ul">
<li><p>
公式如下:
</p>
\begin{equation}
ReLU(x) = max(0,x)
\end{equation}</li>
<li><p>
接入代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Before ReLU: {hidden1}\n\n"</span>)
<span style="color: #076678;">hidden1</span> = nn.ReLU()(hidden1)
<span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"After ReLU: {hidden1}"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org11c39e2">
Before ReLU: tensor([[ 0.0794,  0.5231, -0.2751,  0.3251, -0.1497,  0.2084],
        [ 0.0444,  0.3368, -0.2555,  0.3189, -0.0683,  0.1535],
        [-0.0784,  0.6062, -0.8009,  0.4397,  0.0825,  0.1439]],
       grad_fn=&lt;AddmmBackward&gt;)


After ReLU: tensor([[0.0794, 0.5231, 0.0000, 0.3251, 0.0000, 0.2084],
        [0.0444, 0.3368, 0.0000, 0.3189, 0.0000, 0.1535],
        [0.0000, 0.6062, 0.0000, 0.4397, 0.0825, 0.1439]],
       grad_fn=&lt;ReluBackward0&gt;)
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org833239e" class="outline-4">
<h4 id="org833239e"><span class="section-number-4">5.3.4</span> nn.Sequential</h4>
<div class="outline-text-4" id="text-5-3-4">
<ul class="org-ul">
<li>我们来看看刚才的过程:
<ol class="org-ol">
<li>首先是3*(4*5)的三个raw input</li>
<li>第一个module: flatten, 输入是3*(4*5),输出是3*20</li>
<li>第二个module: nn.Linear(layer1), 输入是3*20,输出是3*6</li>
<li>第三个module: nn.ReLU, 输入是3*6,输出还是3*6,所有负数都变成了零</li>
</ol></li>
<li>我们可以把上面的四个过程统一使用一个module处理,就是nn.Sequential:
<ul class="org-ul">
<li><p>
代码如下,我们最后还多了一层,把output定格为了7
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">seq_modules</span> = nn.Sequential(flatten, layer1, nn.ReLU(), nn.Linear(6, 7))

<span style="color: #076678;">input_image</span> = torch.rand(3, 4, 5)
<span style="color: #076678;">logits</span> = seq_modules(input_image)

<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[logits] ==&gt;"""</span>, logits)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[logits.size()] ==&gt;"""</span>, logits.size())
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgb7743f0">
[logits] ==&gt; tensor([[-2.6497e-01, -9.1267e-02,  6.0936e-02, -1.5278e-02, -3.5053e-01,
          8.0587e-02, -2.1164e-01],
        [-2.3255e-01, -4.9769e-02,  3.9146e-02,  5.0154e-02, -4.0463e-01,
          3.8066e-04, -1.5409e-01],
        [-4.0593e-01, -2.6705e-01, -5.0617e-02, -7.1221e-02, -3.6326e-01,
         -1.1169e-01,  2.1804e-02]], grad_fn=&lt;AddmmBackward&gt;)
[logits.size()] ==&gt; torch.Size([3, 7])
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org60d42c3" class="outline-4">
<h4 id="org60d42c3"><span class="section-number-4">5.3.5</span> nn.Softmax</h4>
<div class="outline-text-4" id="text-5-3-5">
<ul class="org-ul">
<li>为了让我们的分类问题最后的7个output能够满足一个概率分布,他们7个的概率和必须是1,所以要使用module:
nn.Softmax:
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">softmax</span> = nn.Softmax(dim=1)
<span style="color: #076678;">pred_probab</span> = softmax(logits)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[pred_probab] ==&gt;"""</span>, pred_probab)

</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgcc8bfcd">
[pred_probab] ==&gt; tensor([[0.1213, 0.1443, 0.1680, 0.1557, 0.1114, 0.1714, 0.1279],
        [0.1246, 0.1496, 0.1635, 0.1653, 0.1049, 0.1573, 0.1348],
        [0.1125, 0.1292, 0.1604, 0.1572, 0.1174, 0.1509, 0.1725]],
       grad_fn=&lt;SoftmaxBackward&gt;)
</pre></li>
</ul></li>
</ul>
</div>
</div>
</div>
