introduction-to-pytorch.org
** Model Parameters
   + 机器学习是让input和output去拟合一个人类可以理解的函数
   + 深度学习其实也是让input和output去拟合函数,只不过这个函数特别的负载,人类已经无法去理解,因为:
     - 这个函数有很多层
     - 每一层都有对应的weight和bias
     - 这些weight和bias在模型创建的时候都是随机的,通过后面讲的训练会把这些weight和bias朝更拟合output
       的方向调整
     - 到目前为止,我们还没有将训练的过程,所以我们的model里面的weight和bias都是随机的
   + 下面我们使用代码来看看我们生成的model里面随机的weight和bias都是什么样的:
     - 代码如下
       #+begin_src python
         print("Model structure: ", model, "\n\n")

         for name, param in model.named_parameters():
             print(f"Layer: {name} | Size: {param.size()} \nValues: {param[:2]} \n")
       #+end_src
     - 输出如下
       #+begin_example
         Model structure:  NeuralNetwork(
           (flatten): Flatten(start_dim=1, end_dim=-1)
           (linear_relu_stack): Sequential(
             (0): Linear(in_features=784, out_features=512, bias=True)
             (1): ReLU()
             (2): Linear(in_features=512, out_features=512, bias=True)
             (3): ReLU()
             (4): Linear(in_features=512, out_features=10, bias=True)
           )
         )


         Layer: linear_relu_stack.0.weight | Size: torch.Size([512, 784])
         Values: tensor([[ 0.0354, -0.0001,  0.0253,  ..., -0.0030, -0.0246, -0.0285],
                 [ 0.0091,  0.0070,  0.0264,  ..., -0.0156, -0.0108,  0.0153]],
                grad_fn=<SliceBackward>)

         Layer: linear_relu_stack.0.bias | Size: torch.Size([512])
         Values: tensor([ 0.0056, -0.0319], grad_fn=<SliceBackward>)

         Layer: linear_relu_stack.2.weight | Size: torch.Size([512, 512])
         Values: tensor([[-0.0228,  0.0358,  0.0308,  ..., -0.0433, -0.0227, -0.0242],
                 [-0.0052,  0.0408, -0.0430,  ..., -0.0049, -0.0225,  0.0050]],
                grad_fn=<SliceBackward>)

         Layer: linear_relu_stack.2.bias | Size: torch.Size([512])
         Values: tensor([0.0017, 0.0280], grad_fn=<SliceBackward>)

         Layer: linear_relu_stack.4.weight | Size: torch.Size([10, 512])
         Values: tensor([[ 0.0390,  0.0072,  0.0054,  ...,  0.0183,  0.0282,  0.0360],
                 [-0.0165,  0.0336, -0.0274,  ..., -0.0119, -0.0261,  0.0167]],
                grad_fn=<SliceBackward>)

         Layer: linear_relu_stack.4.bias | Size: torch.Size([10])
         Values: tensor([ 0.0213, -0.0026], grad_fn=<SliceBackward>)
       #+end_example
* Automatic Differentitaion With torch.autograd
  + 在训练神经网络的时候,最常用的算法是反向传播(back propagation),在这个算法的运行过程当中,weight和bias
    都会朝着梯度的相反方向进行修正(修正的过程使用optimizer)
  + 为了能够进行反向传播,pytorch必须在每一层都能够自动计算梯度,pytorch里面有个package torch.autograd
    来提供这个功能
  + 我们来看一个最简单的一层layer的例子:
    - input tensor是x, 是一个1*5的matrix
    - 权重是w(weight),是一个5*3的matrix
    - 偏差是b(bias),是一个1*3的matrix
    - output tensor是y,是一个1*3的matrix
    - z是一个简单的神经网络,使用x*w+b得到
    - loss是损失函数
    - 代码如下
      #+begin_src python
        import torch

        x = torch.ones(5)
        y = torch.zeros(3)
        w = torch.randn(5, 3, requires_grad=True)
        b = torch.randn(3, requires_grad=True)
        z = torch.matmul(x, w) + b
        loss = torch.nn.functional.binary_cross_entropy_with_logits(z, y)

        print("""[x] ==>""", x)
        print("""[y] ==>""", y)
        print("""[w] ==>""", w)
        print("""[b] ==>""", b)
        print("""[z] ==>""", z)
        print('''[loss] ==>''', loss)
      #+end_src
    - 输出如下
      #+begin_example
        [x] ==> tensor([1., 1., 1., 1., 1.])
        [y] ==> tensor([0., 0., 0.])
        [w] ==> tensor([[-1.8722,  1.5433, -1.6344],
                [ 0.8174,  0.1571, -1.0487],
                [-1.0059, -0.0180, -1.3587],
                [-0.7847, -0.1392,  0.3352],
                [-0.1005, -0.1010, -0.6419]], requires_grad=True)
        [b] ==> tensor([ 0.1220, -0.6997, -0.6994], requires_grad=True)
        [z] ==> tensor([-2.8239,  0.7424, -5.0480], grad_fn=<AddBackward0>)
        [loss] ==> tensor(0.3986, grad_fn=<BinaryCrossEntropyWithLogitsBackward>)
      #+end_example
** Computing Gradients
   + 为了优化weight和bias,我们需要计算梯度:
     - $\frac{\partial loss}{\partial w}$
     - $\frac{\partial loss}{\partial d}$
   + 计算方法是loss函数(创建的时候就传入了z)调用backward()函数
     - 代码如下
       #+begin_src python
         loss.backward()
         print("""[w.grad] ==>""", w.grad)
         print("""[b.grad] ==>""", b.grad)
       #+end_src
     - 输出如下
       #+begin_example
         [w.grad] ==> tensor([[0.0187, 0.2258, 0.0021],
                 [0.0187, 0.2258, 0.0021],
                 [0.0187, 0.2258, 0.0021],
                 [0.0187, 0.2258, 0.0021],
                 [0.0187, 0.2258, 0.0021]])
         [b.grad] ==> tensor([0.0187, 0.2258, 0.0021])
       #+end_example
** Disabling Gradient Tracking
   + 默认情况下,所有的tensor都有requires_grad=True的设置,也就会同时支持梯度计算
   + 但是有些情况下你可能不想计算梯度:
     - 比如你把一些神经网络的parameter设置为frozen parameter, 这在训练一些pretrained network的时候经常用到
     - 只想做forward pass,不想做back propagation那么停止计算梯度能够提高效率
   + 停止自动计算梯度的方法有两种:
     - 设置no_grad()
       #+begin_src python
         z = torch.matmul(x, w) + b
         print(z.requires_grad)

         with torch.no_grad():
             z = torch.matmul(x, w) + b
         print(z.requires_grad)

         # <===================OUTPUT===================>
         # True
         # False
       #+end_src
     - 调用detach()
       #+begin_src python
         z = torch.matmul(x, w) + b
         z_det = z.detach()
         print(z_det.requires_grad)

         # <===================OUTPUT===================>
         # False
       #+end_src
** More on Computational Graphs
   + pytorch自动求梯度的原理如下:
     - autograd把所有的tensor的executed operation(和数据)都存在了一个DAG里面
     - DAG的root是output tensor
     - DAG的leaves是input tensor
     - 从root到leaf的过程就是自动求梯度的过程
   + TODO
* Optimizing Model Parameters
  + 我们已经有了model和data,那么下一步就是train,validate和test了,这个过程当中再来优化参数
  + 训练模型是一个交互式的过程,分成多个iteration,每个iteration叫一个epoch
  + 每个epoch都会:
    1) 对output做出猜测
    2) 然后通过loss function计算和真实值的差距
    3) 根据差距计算梯度
    4) 根据梯度下降法来optimize参数(weight和bias)
