introduction-to-pytorch.html
<div id="outline-container-orgd69bb23" class="outline-3">
<h3 id="orgd69bb23"><span class="section-number-3">5.4</span> Model Parameters</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>机器学习是让input和output去拟合一个人类可以理解的函数</li>
<li>深度学习其实也是让input和output去拟合函数,只不过这个函数特别的负载,人类已经无法去理解,因为:
<ul class="org-ul">
<li>这个函数有很多层</li>
<li>每一层都有对应的weight和bias</li>
<li>这些weight和bias在模型创建的时候都是随机的,通过后面讲的训练会把这些weight和bias朝更拟合output
的方向调整</li>
<li>到目前为止,我们还没有将训练的过程,所以我们的model里面的weight和bias都是随机的</li>
</ul></li>
<li>下面我们使用代码来看看我们生成的model里面随机的weight和bias都是什么样的:
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Model structure: "</span>, model, <span style="color: #79740e;">"\n\n"</span>)

<span style="color: #9d0006;">for</span> name, param <span style="color: #9d0006;">in</span> model.named_parameters():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Layer: {name} | Size: {param.size()} \nValues: {param[:2]} \n"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org50e473b">
Model structure:  NeuralNetwork(
  (flatten): Flatten(start_dim=1, end_dim=-1)
  (linear_relu_stack): Sequential(
    (0): Linear(in_features=784, out_features=512, bias=True)
    (1): ReLU()
    (2): Linear(in_features=512, out_features=512, bias=True)
    (3): ReLU()
    (4): Linear(in_features=512, out_features=10, bias=True)
  )
)


Layer: linear_relu_stack.0.weight | Size: torch.Size([512, 784])
Values: tensor([[ 0.0354, -0.0001,  0.0253,  ..., -0.0030, -0.0246, -0.0285],
        [ 0.0091,  0.0070,  0.0264,  ..., -0.0156, -0.0108,  0.0153]],
       grad_fn=&lt;SliceBackward&gt;)

Layer: linear_relu_stack.0.bias | Size: torch.Size([512])
Values: tensor([ 0.0056, -0.0319], grad_fn=&lt;SliceBackward&gt;)

Layer: linear_relu_stack.2.weight | Size: torch.Size([512, 512])
Values: tensor([[-0.0228,  0.0358,  0.0308,  ..., -0.0433, -0.0227, -0.0242],
        [-0.0052,  0.0408, -0.0430,  ..., -0.0049, -0.0225,  0.0050]],
       grad_fn=&lt;SliceBackward&gt;)

Layer: linear_relu_stack.2.bias | Size: torch.Size([512])
Values: tensor([0.0017, 0.0280], grad_fn=&lt;SliceBackward&gt;)

Layer: linear_relu_stack.4.weight | Size: torch.Size([10, 512])
Values: tensor([[ 0.0390,  0.0072,  0.0054,  ...,  0.0183,  0.0282,  0.0360],
        [-0.0165,  0.0336, -0.0274,  ..., -0.0119, -0.0261,  0.0167]],
       grad_fn=&lt;SliceBackward&gt;)

Layer: linear_relu_stack.4.bias | Size: torch.Size([10])
Values: tensor([ 0.0213, -0.0026], grad_fn=&lt;SliceBackward&gt;)
</pre></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb8eff61" class="outline-2">
<h2 id="orgb8eff61"><span class="section-number-2">6</span> Automatic Differentitaion With torch.autograd</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>在训练神经网络的时候,最常用的算法是反向传播(back propagation),在这个算法的运行过程当中,weight和bias
都会朝着梯度的相反方向进行修正(修正的过程使用optimizer)</li>
<li>为了能够进行反向传播,pytorch必须在每一层都能够自动计算梯度,pytorch里面有个package torch.autograd
来提供这个功能</li>
<li>我们来看一个最简单的一层layer的例子:
<ul class="org-ul">
<li>input tensor是x, 是一个1*5的matrix</li>
<li>权重是w(weight),是一个5*3的matrix</li>
<li>偏差是b(bias),是一个1*3的matrix</li>
<li>output tensor是y,是一个1*3的matrix</li>
<li>z是一个简单的神经网络,使用x*w+b得到</li>
<li>loss是损失函数</li>
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch

<span style="color: #076678;">x</span> = torch.ones(5)
<span style="color: #076678;">y</span> = torch.zeros(3)
<span style="color: #076678;">w</span> = torch.randn(5, 3, requires_grad=<span style="color: #8f3f71;">True</span>)
<span style="color: #076678;">b</span> = torch.randn(3, requires_grad=<span style="color: #8f3f71;">True</span>)
<span style="color: #076678;">z</span> = torch.matmul(x, w) + b
<span style="color: #076678;">loss</span> = torch.nn.functional.binary_cross_entropy_with_logits(z, y)

<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[x] ==&gt;"""</span>, x)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[y] ==&gt;"""</span>, y)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[w] ==&gt;"""</span>, w)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[b] ==&gt;"""</span>, b)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[z] ==&gt;"""</span>, z)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'''[loss] ==&gt;'''</span>, loss)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgd3b034d">
[x] ==&gt; tensor([1., 1., 1., 1., 1.])
[y] ==&gt; tensor([0., 0., 0.])
[w] ==&gt; tensor([[-1.8722,  1.5433, -1.6344],
        [ 0.8174,  0.1571, -1.0487],
        [-1.0059, -0.0180, -1.3587],
        [-0.7847, -0.1392,  0.3352],
        [-0.1005, -0.1010, -0.6419]], requires_grad=True)
[b] ==&gt; tensor([ 0.1220, -0.6997, -0.6994], requires_grad=True)
[z] ==&gt; tensor([-2.8239,  0.7424, -5.0480], grad_fn=&lt;AddBackward0&gt;)
[loss] ==&gt; tensor(0.3986, grad_fn=&lt;BinaryCrossEntropyWithLogitsBackward&gt;)
</pre></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org191d53d" class="outline-3">
<h3 id="org191d53d"><span class="section-number-3">6.1</span> Computing Gradients</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>为了优化weight和bias,我们需要计算梯度:
<ul class="org-ul">
<li>\(\frac{\partial loss}{\partial w}\)</li>
<li>\(\frac{\partial loss}{\partial d}\)</li>
</ul></li>
<li>计算方法是loss函数(创建的时候就传入了z)调用backward()函数
<ul class="org-ul">
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python">loss.backward()
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[w.grad] ==&gt;"""</span>, w.grad)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"""[b.grad] ==&gt;"""</span>, b.grad)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="orgec40e8c">
[w.grad] ==&gt; tensor([[0.0187, 0.2258, 0.0021],
        [0.0187, 0.2258, 0.0021],
        [0.0187, 0.2258, 0.0021],
        [0.0187, 0.2258, 0.0021],
        [0.0187, 0.2258, 0.0021]])
[b.grad] ==&gt; tensor([0.0187, 0.2258, 0.0021])
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8116a39" class="outline-3">
<h3 id="org8116a39"><span class="section-number-3">6.2</span> Disabling Gradient Tracking</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>默认情况下,所有的tensor都有requires_grad=True的设置,也就会同时支持梯度计算</li>
<li>但是有些情况下你可能不想计算梯度:
<ul class="org-ul">
<li>比如你把一些神经网络的parameter设置为frozen parameter, 这在训练一些pretrained network的时候经常用到</li>
<li>只想做forward pass,不想做back propagation那么停止计算梯度能够提高效率</li>
</ul></li>
<li>停止自动计算梯度的方法有两种:
<ul class="org-ul">
<li><p>
设置no_grad()
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">z</span> = torch.matmul(x, w) + b
<span style="color: #9d0006;">print</span>(z.requires_grad)

<span style="color: #9d0006;">with</span> torch.no_grad():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">z</span> = torch.matmul(x, w) + b
<span style="color: #9d0006;">print</span>(z.requires_grad)

<span style="color: #a89984;"># </span><span style="color: #a89984;">&lt;===================OUTPUT===================&gt;</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">True</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">False</span>
</pre>
</div></li>
<li><p>
调用detach()
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">z</span> = torch.matmul(x, w) + b
<span style="color: #076678;">z_det</span> = z.detach()
<span style="color: #9d0006;">print</span>(z_det.requires_grad)

<span style="color: #a89984;"># </span><span style="color: #a89984;">&lt;===================OUTPUT===================&gt;</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">False</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org061bfc4" class="outline-3">
<h3 id="org061bfc4"><span class="section-number-3">6.3</span> More on Computational Graphs</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>pytorch自动求梯度的原理如下:
<ul class="org-ul">
<li>autograd把所有的tensor的executed operation(和数据)都存在了一个DAG里面</li>
<li>DAG的root是output tensor</li>
<li>DAG的leaves是input tensor</li>
<li>从root到leaf的过程就是自动求梯度的过程</li>
</ul></li>
<li>TODO</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6b7d65a" class="outline-2">
<h2 id="org6b7d65a"><span class="section-number-2">7</span> Optimizing Model Parameters</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>我们已经有了model和data,那么下一步就是train,validate和test了,这个过程当中再来优化参数</li>
<li>训练模型是一个交互式的过程,分成多个iteration,每个iteration叫一个epoch</li>
<li>每个epoch都会:
<ol class="org-ol">
<li>对output做出猜测</li>
<li>然后通过loss function计算和真实值的差距</li>
<li>根据差距计算梯度</li>
<li>根据梯度下降法来optimize参数(weight和bias)</li>
</ol></li>
</ul>
</div>
