introduction-to-pytorch.org
** Prereuisite Code
   + 从前面的代码中拷贝如下代码
     #+begin_src python
       import torch
       from torch import nn
       from torch.utils.data import DataLoader
       from torchvision import datasets
       from torchvision.transforms import ToTensor, Lambda

       training_data = datasets.FashionMNIST(
           root="data", train=True, download=True, transform=ToTensor()
       )

       test_data = datasets.FashionMNIST(
           root="data", train=False, download=True, transform=ToTensor()
       )

       train_dataloader = DataLoader(training_data, batch_size=64)
       test_dataloader = DataLoader(test_data, batch_size=64)


       class NeuralNetwork(nn.Module):
           def __init__(self):
               super(NeuralNetwork, self).__init__()
               self.flatten = nn.Flatten()
               self.linear_relu_stack = nn.Sequential(
                   nn.Linear(28 * 28, 512),
                   nn.ReLU(),
                   nn.Linear(512, 512),
                   nn.ReLU(),
                   nn.Linear(512, 10),
               )

           def forward(self, x):
               x = self.flatten(x)
               logits = self.linear_relu_stack(x)
               return logits


       model = NeuralNetwork()
     #+end_src
** Hyperparameters
   + 所谓超参(hyperparameter)是相对于参数(weight和bias)而言的
     - 参数(weight和bias)是神经网络自己维持的参数,是pytorch的使用人员无法更改的
     - 超参(hyperparameter)则不同,其是用来控制optimization process的
   + 我们这里定义三个超参:
     - Number of Epochs: 迭代多少次,一般来说,迭代的越多,最后模型的准确率越高
     - Batch Size: parameter更新之前,有多少的data sample穿过神经网络
     - Learning Rate: 每个epoch,我们超"梯度的反方向"更新参数的时候,更新大. 这个数目小了,容易降低learning
       speed,但是如果太大了,会导致unpredictable behavior
     - 代码如下
       #+begin_src python
         learning_rate = 1e-3
         batch_size = 64
         epochs = 5
       #+end_src
** Optimization Loop
   + 每个loop主要包含两个部分:
     - Train Loop, 遍历training data set,试图优化参数
     - The Validation/Test Loop, 遍历test data set,看看我们的model performance是否提高了(如果没有提高
       可以中断训练,寻找bug)
*** Loss Function
    + 当给与training data的时候,我们untrained network肯定会给出一个不正确的答案
    + Loss function就是来度量我们的答案和正确答案之间的差距的,因为我们model的目的就是让loss function最小
    + 常见的loss function有:
      - nn.MSELoss(Mean Square Error),主要为regression task服务
      - nn.NLLLoss(Negative Log Likelihood),主要为classification服务
      - nn.CrossEntropyLoss,结合了nn.LogSoftmax和nn.NLLLoss
    + 我们这里使用nn.CrossEntropyLoss
      #+begin_src python
        loss_fn = nn.CrossEntropyLoss()
      #+end_src
*** Optimizer
    + optimization是adjust model参数,并且减小model error的过程
    + optimization algorithm是说我们如何超梯度的方向减少(比如SGD就是随机找一个向量的方向减少,而不是全部,为了减少运算量)
    + optimization在pytorch里面被封装成optimizer,常见的optimizer有:
      - SGD
      - ADAM
      - RMSProp
    + 初始化optimizer需要输入model的参数和learning_rate
      #+begin_src python
        optimizer = torch.optim.SGD(model.parameters(), lr=learning_rate)
      #+end_src
    + 在一个training loop里面,我们要做到如下三个step:
      1) 调用optimizer.zero_grad()来reset 梯度的值,因为梯度的值是累加的,不清空会成倍累计
      2) 使用loss.backwards()来进行反向传播的过程,然后把每个参数的梯度记录下来
      3) 一旦有了梯度,我们就调用optimizer.step(),来使用特定的optimization algorithm来调整参数
