introduction-to-pytorch.html
<div id="outline-container-org489aa06" class="outline-3">
<h3 id="org489aa06"><span class="section-number-3">7.1</span> Prereuisite Code</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><p>
从前面的代码中拷贝如下代码
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">from</span> torch <span style="color: #9d0006;">import</span> nn
<span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> DataLoader
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets
<span style="color: #9d0006;">from</span> torchvision.transforms <span style="color: #9d0006;">import</span> ToTensor, Lambda

<span style="color: #076678;">training_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>, train=<span style="color: #8f3f71;">True</span>, download=<span style="color: #8f3f71;">True</span>, transform=ToTensor()
)

<span style="color: #076678;">test_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>, train=<span style="color: #8f3f71;">False</span>, download=<span style="color: #8f3f71;">True</span>, transform=ToTensor()
)

<span style="color: #076678;">train_dataloader</span> = DataLoader(training_data, batch_size=64)
<span style="color: #076678;">test_dataloader</span> = DataLoader(test_data, batch_size=64)


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">NeuralNetwork</span>(nn.Module):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #af3a03;">super</span>(NeuralNetwork, <span style="color: #9d0006;">self</span>).__init__()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.flatten = nn.Flatten()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.linear_relu_stack = nn.Sequential(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(28 * 28, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 10),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   )

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">forward</span>(<span style="color: #9d0006;">self</span>, x):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">x</span> = <span style="color: #9d0006;">self</span>.flatten(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">logits</span> = <span style="color: #9d0006;">self</span>.linear_relu_stack(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> logits


<span style="color: #076678;">model</span> = NeuralNetwork()
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgd546989" class="outline-3">
<h3 id="orgd546989"><span class="section-number-3">7.2</span> Hyperparameters</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>所谓超参(hyperparameter)是相对于参数(weight和bias)而言的
<ul class="org-ul">
<li>参数(weight和bias)是神经网络自己维持的参数,是pytorch的使用人员无法更改的</li>
<li>超参(hyperparameter)则不同,其是用来控制optimization process的</li>
</ul></li>
<li>我们这里定义三个超参:
<ul class="org-ul">
<li>Number of Epochs: 迭代多少次,一般来说,迭代的越多,最后模型的准确率越高</li>
<li>Batch Size: parameter更新之前,有多少的data sample穿过神经网络</li>
<li>Learning Rate: 每个epoch,我们超"梯度的反方向"更新参数的时候,更新大. 这个数目小了,容易降低learning
speed,但是如果太大了,会导致unpredictable behavior</li>
<li><p>
代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">learning_rate</span> = 1e-3
<span style="color: #076678;">batch_size</span> = 64
<span style="color: #076678;">epochs</span> = 5
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6a4debe" class="outline-3">
<h3 id="org6a4debe"><span class="section-number-3">7.3</span> Optimization Loop</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>每个loop主要包含两个部分:
<ul class="org-ul">
<li>Train Loop, 遍历training data set,试图优化参数</li>
<li>The Validation/Test Loop, 遍历test data set,看看我们的model performance是否提高了(如果没有提高
可以中断训练,寻找bug)</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgb5bb0c0" class="outline-4">
<h4 id="orgb5bb0c0"><span class="section-number-4">7.3.1</span> Loss Function</h4>
<div class="outline-text-4" id="text-7-3-1">
<ul class="org-ul">
<li>当给与training data的时候,我们untrained network肯定会给出一个不正确的答案</li>
<li>Loss function就是来度量我们的答案和正确答案之间的差距的,因为我们model的目的就是让loss function最小</li>
<li>常见的loss function有:
<ul class="org-ul">
<li>nn.MSELoss(Mean Square Error),主要为regression task服务</li>
<li>nn.NLLLoss(Negative Log Likelihood),主要为classification服务</li>
<li>nn.CrossEntropyLoss,结合了nn.LogSoftmax和nn.NLLLoss</li>
</ul></li>
<li><p>
我们这里使用nn.CrossEntropyLoss
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">loss_fn</span> = nn.CrossEntropyLoss()
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org54eabb3" class="outline-4">
<h4 id="org54eabb3"><span class="section-number-4">7.3.2</span> Optimizer</h4>
<div class="outline-text-4" id="text-7-3-2">
<ul class="org-ul">
<li>optimization是adjust model参数,并且减小model error的过程</li>
<li>optimization algorithm是说我们如何超梯度的方向减少(比如SGD就是随机找一个向量的方向减少,而不是全部,为了减少运算量)</li>
<li>optimization在pytorch里面被封装成optimizer,常见的optimizer有:
<ul class="org-ul">
<li>SGD</li>
<li>ADAM</li>
<li>RMSProp</li>
</ul></li>
<li><p>
初始化optimizer需要输入model的参数和learning_rate
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">optimizer</span> = torch.optim.SGD(model.parameters(), lr=learning_rate)
</pre>
</div></li>
<li>在一个training loop里面,我们要做到如下三个step:
<ol class="org-ol">
<li>调用optimizer.zero_grad()来reset 梯度的值,因为梯度的值是累加的,不清空会成倍累计</li>
<li>使用loss.backwards()来进行反向传播的过程,然后把每个参数的梯度记录下来</li>
<li>一旦有了梯度,我们就调用optimizer.step(),来使用特定的optimization algorithm来调整参数</li>
</ol></li>
</ul>
</div>
</div>
</div>
