introduction-to-pytorch.org
** Full Implementation
   + 全部代码如下
     #+begin_src python
       import torch
       from torch import nn
       from torch.utils.data import DataLoader
       from torchvision import datasets
       from torchvision.transforms import ToTensor, Lambda

       training_data = datasets.FashionMNIST(
           root="data", train=True, download=True, transform=ToTensor()
       )

       test_data = datasets.FashionMNIST(
           root="data", train=False, download=True, transform=ToTensor()
       )

       train_dataloader = DataLoader(training_data, batch_size=64)
       test_dataloader = DataLoader(test_data, batch_size=64)


       class NeuralNetwork(nn.Module):
           def __init__(self):
               super(NeuralNetwork, self).__init__()
               self.flatten = nn.Flatten()
               self.linear_relu_stack = nn.Sequential(
                   nn.Linear(28 * 28, 512),
                   nn.ReLU(),
                   nn.Linear(512, 512),
                   nn.ReLU(),
                   nn.Linear(512, 10),
               )

           def forward(self, x):
               x = self.flatten(x)
               logits = self.linear_relu_stack(x)
               return logits


       model = NeuralNetwork()


       learning_rate = 1e-3
       batch_size = 64
       epochs = 5


       def train_loop(dataloader, model, loss_fn, optimizer):
           size = len(dataloader.dataset)
           for batch, (X, y) in enumerate(dataloader):
               # Compute prediction and loss
               pred = model(X)
               loss = loss_fn(pred, y)

               # Backpropagation
               optimizer.zero_grad()
               loss.backward()
               optimizer.step()

               if batch % 100 == 0:
                   loss, current = loss.item(), batch * len(X)
                   print(f"loss: {loss:>7f}  [{current:>5d}/{size:>5d}]")


       def test_loop(dataloader, model, loss_fn):
           size = len(dataloader.dataset)
           num_batches = len(dataloader)
           test_loss, correct = 0, 0

           with torch.no_grad():
               for X, y in dataloader:
                   pred = model(X)
                   test_loss += loss_fn(pred, y).item()
                   correct += (pred.argmax(1) == y).type(torch.float).sum().item()

           test_loss /= num_batches
           correct /= size
           print(
               f"Test Error: \n Accuracy: {(100*correct):>0.1f}%, Avg loss: {test_loss:>8f} \n"
           )


       loss_fn = nn.CrossEntropyLoss()
       optimizer = torch.optim.SGD(model.parameters(), lr=learning_rate)

       epochs = 10
       for t in range(epochs):
           print(f"Epoch {t+1}\n-------------------------------")
           train_loop(train_dataloader, model, loss_fn, optimizer)
           test_loop(test_dataloader, model, loss_fn)
       print("Done!")
     #+end_src
   + 输出如下
     #+begin_example
       Epoch 1
       -------------------------------
       loss: 2.290681  [    0/60000]
       loss: 2.287182  [ 6400/60000]
       loss: 2.269812  [12800/60000]
       loss: 2.266142  [19200/60000]
       loss: 2.256343  [25600/60000]
       loss: 2.220319  [32000/60000]
       loss: 2.229174  [38400/60000]
       loss: 2.187555  [44800/60000]
       loss: 2.194004  [51200/60000]
       loss: 2.173015  [57600/60000]
       Test Error:
        Accuracy: 45.8%, Avg loss: 2.157823

       Epoch 2
       -------------------------------
       loss: 2.159005  [    0/60000]
       loss: 2.162359  [ 6400/60000]
       loss: 2.105484  [12800/60000]
       loss: 2.121630  [19200/60000]
       loss: 2.078309  [25600/60000]
       loss: 2.014289  [32000/60000]
       loss: 2.043489  [38400/60000]
       loss: 1.956825  [44800/60000]
       loss: 1.975176  [51200/60000]
       loss: 1.920474  [57600/60000]
       Test Error:
        Accuracy: 55.7%, Avg loss: 1.903461

       Epoch 3
       -------------------------------
       loss: 1.928488  [    0/60000]
       loss: 1.913021  [ 6400/60000]
       loss: 1.795003  [12800/60000]
       loss: 1.833542  [19200/60000]
       loss: 1.736217  [25600/60000]
       loss: 1.679621  [32000/60000]
       loss: 1.705046  [38400/60000]
       loss: 1.591978  [44800/60000]
       loss: 1.635176  [51200/60000]
       loss: 1.541151  [57600/60000]
       Test Error:
        Accuracy: 59.6%, Avg loss: 1.542476

       Epoch 4
       -------------------------------
       loss: 1.602455  [    0/60000]
       loss: 1.576380  [ 6400/60000]
       loss: 1.420821  [12800/60000]
       loss: 1.492640  [19200/60000]
       loss: 1.386150  [25600/60000]
       loss: 1.369658  [32000/60000]
       loss: 1.383621  [38400/60000]
       loss: 1.293382  [44800/60000]
       loss: 1.349705  [51200/60000]
       loss: 1.254283  [57600/60000]
       Test Error:
        Accuracy: 62.8%, Avg loss: 1.270659

       Epoch 5
       -------------------------------
       loss: 1.342015  [    0/60000]
       loss: 1.327567  [ 6400/60000]
       loss: 1.159419  [12800/60000]
       loss: 1.263751  [19200/60000]
       loss: 1.154799  [25600/60000]
       loss: 1.169653  [32000/60000]
       loss: 1.184060  [38400/60000]
       loss: 1.109008  [44800/60000]
       loss: 1.170164  [51200/60000]
       loss: 1.086842  [57600/60000]
       Test Error:
        Accuracy: 64.7%, Avg loss: 1.101013

       Epoch 6
       -------------------------------
       loss: 1.168192  [    0/60000]
       loss: 1.168162  [ 6400/60000]
       loss: 0.987777  [12800/60000]
       loss: 1.118827  [19200/60000]
       loss: 1.011244  [25600/60000]
       loss: 1.035202  [32000/60000]
       loss: 1.060468  [38400/60000]
       loss: 0.991097  [44800/60000]
       loss: 1.054724  [51200/60000]
       loss: 0.981641  [57600/60000]
       Test Error:
        Accuracy: 66.0%, Avg loss: 0.991141

       Epoch 7
       -------------------------------
       loss: 1.047844  [    0/60000]
       loss: 1.064381  [ 6400/60000]
       loss: 0.870337  [12800/60000]
       loss: 1.021567  [19200/60000]
       loss: 0.921638  [25600/60000]
       loss: 0.939490  [32000/60000]
       loss: 0.979135  [38400/60000]
       loss: 0.913901  [44800/60000]
       loss: 0.975232  [51200/60000]
       loss: 0.910894  [57600/60000]
       Test Error:
        Accuracy: 67.3%, Avg loss: 0.916158

       Epoch 8
       -------------------------------
       loss: 0.959148  [    0/60000]
       loss: 0.992466  [ 6400/60000]
       loss: 0.786403  [12800/60000]
       loss: 0.952738  [19200/60000]
       loss: 0.862164  [25600/60000]
       loss: 0.869106  [32000/60000]
       loss: 0.921611  [38400/60000]
       loss: 0.862038  [44800/60000]
       loss: 0.917971  [51200/60000]
       loss: 0.860151  [57600/60000]
       Test Error:
        Accuracy: 68.5%, Avg loss: 0.862315

       Epoch 9
       -------------------------------
       loss: 0.891266  [    0/60000]
       loss: 0.939044  [ 6400/60000]
       loss: 0.723808  [12800/60000]
       loss: 0.901962  [19200/60000]
       loss: 0.819886  [25600/60000]
       loss: 0.816061  [32000/60000]
       loss: 0.878376  [38400/60000]
       loss: 0.825895  [44800/60000]
       loss: 0.875392  [51200/60000]
       loss: 0.821557  [57600/60000]
       Test Error:
        Accuracy: 69.7%, Avg loss: 0.821707

       Epoch 10
       -------------------------------
       loss: 0.837337  [    0/60000]
       loss: 0.896555  [ 6400/60000]
       loss: 0.675275  [12800/60000]
       loss: 0.863091  [19200/60000]
       loss: 0.787557  [25600/60000]
       loss: 0.775253  [32000/60000]
       loss: 0.844009  [38400/60000]
       loss: 0.799441  [44800/60000]
       loss: 0.842212  [51200/60000]
       loss: 0.790734  [57600/60000]
       Test Error:
        Accuracy: 71.1%, Avg loss: 0.789619

       Done!
     #+end_example
