introduction-to-pytorch.html
<div id="outline-container-org662063c" class="outline-3">
<h3 id="org662063c"><span class="section-number-3">7.4</span> Full Implementation</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li><p>
全部代码如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">from</span> torch <span style="color: #9d0006;">import</span> nn
<span style="color: #9d0006;">from</span> torch.utils.data <span style="color: #9d0006;">import</span> DataLoader
<span style="color: #9d0006;">from</span> torchvision <span style="color: #9d0006;">import</span> datasets
<span style="color: #9d0006;">from</span> torchvision.transforms <span style="color: #9d0006;">import</span> ToTensor, Lambda

<span style="color: #076678;">training_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>, train=<span style="color: #8f3f71;">True</span>, download=<span style="color: #8f3f71;">True</span>, transform=ToTensor()
)

<span style="color: #076678;">test_data</span> = datasets.FashionMNIST(
<span style="background-color: #ebdbb2;"> </span>   root=<span style="color: #79740e;">"data"</span>, train=<span style="color: #8f3f71;">False</span>, download=<span style="color: #8f3f71;">True</span>, transform=ToTensor()
)

<span style="color: #076678;">train_dataloader</span> = DataLoader(training_data, batch_size=64)
<span style="color: #076678;">test_dataloader</span> = DataLoader(test_data, batch_size=64)


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">NeuralNetwork</span>(nn.Module):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #af3a03;">super</span>(NeuralNetwork, <span style="color: #9d0006;">self</span>).__init__()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.flatten = nn.Flatten()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.linear_relu_stack = nn.Sequential(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(28 * 28, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 512),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.ReLU(),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   nn.Linear(512, 10),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   )

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">forward</span>(<span style="color: #9d0006;">self</span>, x):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">x</span> = <span style="color: #9d0006;">self</span>.flatten(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">logits</span> = <span style="color: #9d0006;">self</span>.linear_relu_stack(x)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> logits


<span style="color: #076678;">model</span> = NeuralNetwork()


<span style="color: #076678;">learning_rate</span> = 1e-3
<span style="color: #076678;">batch_size</span> = 64
<span style="color: #076678;">epochs</span> = 5


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">train_loop</span>(dataloader, model, loss_fn, optimizer):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">size</span> = <span style="color: #af3a03;">len</span>(dataloader.dataset)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> batch, (X, y) <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">enumerate</span>(dataloader):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">Compute prediction and loss</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">pred</span> = model(X)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">loss</span> = loss_fn(pred, y)

<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">Backpropagation</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   optimizer.zero_grad()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   loss.backward()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   optimizer.step()

<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">if</span> batch % 100 == 0:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">loss</span>, <span style="color: #076678;">current</span> = loss.item(), batch * <span style="color: #af3a03;">len</span>(X)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"loss: {loss:&gt;7f}  [{current:&gt;5d}/{size:&gt;5d}]"</span>)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">test_loop</span>(dataloader, model, loss_fn):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">size</span> = <span style="color: #af3a03;">len</span>(dataloader.dataset)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">num_batches</span> = <span style="color: #af3a03;">len</span>(dataloader)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">test_loss</span>, <span style="color: #076678;">correct</span> = 0, 0

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">with</span> torch.no_grad():
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> X, y <span style="color: #9d0006;">in</span> dataloader:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">pred</span> = model(X)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">test_loss</span> += loss_fn(pred, y).item()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">correct</span> += (pred.argmax(1) == y).<span style="color: #af3a03;">type</span>(torch.<span style="color: #af3a03;">float</span>).<span style="color: #af3a03;">sum</span>().item()

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">test_loss</span> /= num_batches
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">correct</span> /= size
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   f<span style="color: #79740e;">"Test Error: \n Accuracy: {(100*correct):&gt;0.1f}%, Avg loss: {test_loss:&gt;8f} \n"</span>
<span style="background-color: #ebdbb2;"> </span>   )


<span style="color: #076678;">loss_fn</span> = nn.CrossEntropyLoss()
<span style="color: #076678;">optimizer</span> = torch.optim.SGD(model.parameters(), lr=learning_rate)

<span style="color: #076678;">epochs</span> = 10
<span style="color: #9d0006;">for</span> t <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">range</span>(epochs):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(f<span style="color: #79740e;">"Epoch {t+1}\n-------------------------------"</span>)
<span style="background-color: #ebdbb2;"> </span>   train_loop(train_dataloader, model, loss_fn, optimizer)
<span style="background-color: #ebdbb2;"> </span>   test_loop(test_dataloader, model, loss_fn)
<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Done!"</span>)
</pre>
</div></li>
<li><p>
输出如下
</p>
<pre class="example" id="org440a100">
Epoch 1
-------------------------------
loss: 2.290681  [    0/60000]
loss: 2.287182  [ 6400/60000]
loss: 2.269812  [12800/60000]
loss: 2.266142  [19200/60000]
loss: 2.256343  [25600/60000]
loss: 2.220319  [32000/60000]
loss: 2.229174  [38400/60000]
loss: 2.187555  [44800/60000]
loss: 2.194004  [51200/60000]
loss: 2.173015  [57600/60000]
Test Error:
 Accuracy: 45.8%, Avg loss: 2.157823

Epoch 2
-------------------------------
loss: 2.159005  [    0/60000]
loss: 2.162359  [ 6400/60000]
loss: 2.105484  [12800/60000]
loss: 2.121630  [19200/60000]
loss: 2.078309  [25600/60000]
loss: 2.014289  [32000/60000]
loss: 2.043489  [38400/60000]
loss: 1.956825  [44800/60000]
loss: 1.975176  [51200/60000]
loss: 1.920474  [57600/60000]
Test Error:
 Accuracy: 55.7%, Avg loss: 1.903461

Epoch 3
-------------------------------
loss: 1.928488  [    0/60000]
loss: 1.913021  [ 6400/60000]
loss: 1.795003  [12800/60000]
loss: 1.833542  [19200/60000]
loss: 1.736217  [25600/60000]
loss: 1.679621  [32000/60000]
loss: 1.705046  [38400/60000]
loss: 1.591978  [44800/60000]
loss: 1.635176  [51200/60000]
loss: 1.541151  [57600/60000]
Test Error:
 Accuracy: 59.6%, Avg loss: 1.542476

Epoch 4
-------------------------------
loss: 1.602455  [    0/60000]
loss: 1.576380  [ 6400/60000]
loss: 1.420821  [12800/60000]
loss: 1.492640  [19200/60000]
loss: 1.386150  [25600/60000]
loss: 1.369658  [32000/60000]
loss: 1.383621  [38400/60000]
loss: 1.293382  [44800/60000]
loss: 1.349705  [51200/60000]
loss: 1.254283  [57600/60000]
Test Error:
 Accuracy: 62.8%, Avg loss: 1.270659

Epoch 5
-------------------------------
loss: 1.342015  [    0/60000]
loss: 1.327567  [ 6400/60000]
loss: 1.159419  [12800/60000]
loss: 1.263751  [19200/60000]
loss: 1.154799  [25600/60000]
loss: 1.169653  [32000/60000]
loss: 1.184060  [38400/60000]
loss: 1.109008  [44800/60000]
loss: 1.170164  [51200/60000]
loss: 1.086842  [57600/60000]
Test Error:
 Accuracy: 64.7%, Avg loss: 1.101013

Epoch 6
-------------------------------
loss: 1.168192  [    0/60000]
loss: 1.168162  [ 6400/60000]
loss: 0.987777  [12800/60000]
loss: 1.118827  [19200/60000]
loss: 1.011244  [25600/60000]
loss: 1.035202  [32000/60000]
loss: 1.060468  [38400/60000]
loss: 0.991097  [44800/60000]
loss: 1.054724  [51200/60000]
loss: 0.981641  [57600/60000]
Test Error:
 Accuracy: 66.0%, Avg loss: 0.991141

Epoch 7
-------------------------------
loss: 1.047844  [    0/60000]
loss: 1.064381  [ 6400/60000]
loss: 0.870337  [12800/60000]
loss: 1.021567  [19200/60000]
loss: 0.921638  [25600/60000]
loss: 0.939490  [32000/60000]
loss: 0.979135  [38400/60000]
loss: 0.913901  [44800/60000]
loss: 0.975232  [51200/60000]
loss: 0.910894  [57600/60000]
Test Error:
 Accuracy: 67.3%, Avg loss: 0.916158

Epoch 8
-------------------------------
loss: 0.959148  [    0/60000]
loss: 0.992466  [ 6400/60000]
loss: 0.786403  [12800/60000]
loss: 0.952738  [19200/60000]
loss: 0.862164  [25600/60000]
loss: 0.869106  [32000/60000]
loss: 0.921611  [38400/60000]
loss: 0.862038  [44800/60000]
loss: 0.917971  [51200/60000]
loss: 0.860151  [57600/60000]
Test Error:
 Accuracy: 68.5%, Avg loss: 0.862315

Epoch 9
-------------------------------
loss: 0.891266  [    0/60000]
loss: 0.939044  [ 6400/60000]
loss: 0.723808  [12800/60000]
loss: 0.901962  [19200/60000]
loss: 0.819886  [25600/60000]
loss: 0.816061  [32000/60000]
loss: 0.878376  [38400/60000]
loss: 0.825895  [44800/60000]
loss: 0.875392  [51200/60000]
loss: 0.821557  [57600/60000]
Test Error:
 Accuracy: 69.7%, Avg loss: 0.821707

Epoch 10
-------------------------------
loss: 0.837337  [    0/60000]
loss: 0.896555  [ 6400/60000]
loss: 0.675275  [12800/60000]
loss: 0.863091  [19200/60000]
loss: 0.787557  [25600/60000]
loss: 0.775253  [32000/60000]
loss: 0.844009  [38400/60000]
loss: 0.799441  [44800/60000]
loss: 0.842212  [51200/60000]
loss: 0.790734  [57600/60000]
Test Error:
 Accuracy: 71.1%, Avg loss: 0.789619

Done!
</pre></li>
</ul>
</div>
</div>
</div>
