introduction-to-pytorch.org
* Save and Load the Model
** Saving and Loading Model Weights
   + pytorch会把学到的参数存储在内部的一个字典里面,叫做state_dict,我们可以只持久化存储这些参数
     #+begin_src python
       import torch
       import torchvision.models as models

       model = models.vgg16(pretrained=True)
       torc.save(model.state_dict(), 'model_weights.pth')
     #+end_src
   + 到用到的志恒,我们之间创建以一样的model,然后使用函数load_state_dict来load这些参数,当然要记得eval()后才能使用
     #+begin_src python
       model = models.vgg16()
       model.load_state_dict(torch.load('model_weights.pth'))
       model.eval()
     #+end_src
** Saving and Loading Models with Shapes
   + 我们上面只save了model的参数,其实我们的model也可以和参数一块被save
     #+begin_src python
       torch.save(model, 'model.pth')
     #+end_src
   + load的时候如下
     #+begin_src python
       model = torch.load('model.pth')
     #+end_src
   + 这个方法的内部原理是使用了python的序列化库pickle,所以在load的时候要保证当前的python环境能够load到class definition
