introduction-to-pytorch.html
<div id="outline-container-org32f9cbf" class="outline-2">
<h2 id="org32f9cbf"><span class="section-number-2">8</span> Save and Load the Model</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org595b05a" class="outline-3">
<h3 id="org595b05a"><span class="section-number-3">8.1</span> Saving and Loading Model Weights</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><p>
pytorch会把学到的参数存储在内部的一个字典里面,叫做state_dict,我们可以只持久化存储这些参数
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> torch
<span style="color: #9d0006;">import</span> torchvision.models <span style="color: #9d0006;">as</span> models

<span style="color: #076678;">model</span> = models.vgg16(pretrained=<span style="color: #8f3f71;">True</span>)
torc.save(model.state_dict(), <span style="color: #79740e;">'model_weights.pth'</span>)
</pre>
</div></li>
<li><p>
到用到的志恒,我们之间创建以一样的model,然后使用函数load_state_dict来load这些参数,当然要记得eval()后才能使用
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">model</span> = models.vgg16()
model.load_state_dict(torch.load(<span style="color: #79740e;">'model_weights.pth'</span>))
model.<span style="color: #af3a03;">eval</span>()
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org89d5d93" class="outline-3">
<h3 id="org89d5d93"><span class="section-number-3">8.2</span> Saving and Loading Models with Shapes</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li><p>
我们上面只save了model的参数,其实我们的model也可以和参数一块被save
</p>
<div class="org-src-container">
<pre class="src src-python">torch.save(model, <span style="color: #79740e;">'model.pth'</span>)
</pre>
</div></li>
<li><p>
load的时候如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #076678;">model</span> = torch.load(<span style="color: #79740e;">'model.pth'</span>)
</pre>
</div></li>
<li>这个方法的内部原理是使用了python的序列化库pickle,所以在load的时候要保证当前的python环境能够load到class definition</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: harrifeng@outlook.com</p>
<p class="date">Created: 2021-11-18 Thu 19:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
